import sys

content = """Дата создания заказа,Номер заказа,Менеджер,Способ оплаты,Тип товара,Кол-во товара,Цена в Б24,Цена закупки,ЧП,Маржа,Наименование
29.03.2026,16991,Казаков Артём,Наличные,Техника магазин,1,73 900,58 600,15 300,"20,7%","Робот-пылесос Dreame X40 Ultra Complete EU, Белый"
31.03.2026,17096,Смирнов Андрей,Наличные,Техника Горбушка,1,17 100,15 300,1 800,"10,5%",Смартфон Xiaomi Redmi Note 15 4G | 8-256 ГБ (Фиолетовый | Mist Purple)
31.03.2026,17090,Соловьёв Андрей,Наличные,Техника Горбушка,1,52 700,51 000,1 700,"3,2%","Планшет Apple iPad (2025 A16) 11"" Wi-Fi | 512 ГБ (Silver | Серебристый)"
31.03.2026,17087,Смирнов Андрей,Наличные,Техника Горбушка,1,20 900,17 600,3 300,"15,8%",Беспроводные наушники AirPods Pro 3 MagSafe (USB-C) (2025)
01.04.2026,17125,Бобылев Антон,Наличные,Техника Горбушка,1,69 200,64 500,4 700,"6,8%",Смартфон Apple iPhone 17 | 256 ГБ (Голубой | Mist Blue)
01.04.2026,17119,Соловьёв Андрей,Наличные,Техника магазин,1,115 900,104 000,11 900,"10,3%",Смартфон Xiaomi 17 Ultra 16/1 ТБ Черный
01.04.2026,17123,Соловьёв Андрей,Наличные,Техника Горбушка,1,90 000,78 500,11 500,"12,8%",Смартфон Huawei Pura 80 Ultra 512 ГБ (Prestige Gold | Золотой)
01.04.2026,17127,Соловьёв Андрей,Наличные,Техника Горбушка,1,39 000,35 000,4 000,"10,3%",Наушники Apple AirPods Max Lightning (MGYH3) Space Gray
01.04.2026,17104,Смирнов Андрей,Наличные,Техника Горбушка,1,153 500,145 000,8 500,"5,5%",Смартфон Apple iPhone 17 Pro | 1 ТБ (Deep Blue | Глубокий синий)
01.04.2026,17132,Соловьёв Андрей,Наличные,Техника Горбушка,1,68 480,57 000,11 480,"16,8%","Смартфон Samsung Galaxy S25 Plus | 12/256 ГБ, Серый"
01.04.2026,17133,Соловьёв Андрей,Наличные,Техника Горбушка,1,44 000,40 000,4 000,"9,1%",Планшет Samsung Galaxy Tab S10 FE | Wi-Fi | 12/256 ГБ Голубой
30.03.2026,17070,Соловьёв Андрей,Наличные,Техника Горбушка,1,9 000,7 500,1 500,"16,7%",Смартфон Xiaomi Poco C85 | 6/128 ГБ Черный
01.04.2026,17144,Бобылев Антон,Наличные,Техника Горбушка,1,13 000,11 200,1 800,"13,8%","Наушники AirPods (4-го поколения, 2024) с шумоподавлением"
01.04.2026,17144,Бобылев Антон,Наличные,Техника Горбушка,1,39 500,34 500,5 000,"12,7%",Стайлер Dyson Airwrap i.d. Long HS08 Straight+Wavy Amber Silk
01.04.2026,17142,Бобылев Антон,Наличные,Техника Горбушка,1,115 500,112 500,3 000,"2,6%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Silver | Серебристый)
01.04.2026,17147,Бобылев Антон,Наличные,Техника магазин,1,46 900,46 900,0,"0,0%",Смартфон OnePlus 13 12/256 ГБ (Черный | Black Eclipse)
01.04.2026,17149,Миннеахметов Дамир,Наличные,Техника магазин,1,115 900,95 000,20 900,"18,0%",Смартфон Xiaomi 17 Ultra 16/512 ГБ Белый
02.04.2026,17154,Смирнов Андрей,Наличные,Техника магазин,1,80 500,68 400,12 100,"15,0%",Смартфон Xiaomi 17 | 12-512 ГБ (Зеленый | Venture Green)
02.04.2026,17169,Миннеахметов Дамир,Наличные,Техника Горбушка,1,39 000,37 000,2 000,"5,1%","Планшет Apple iPad Mini 7Gen (2024 A17 Pro) 8.3"" Wi-Fi | 128 ГБ Space gray"
02.04.2026,17169,Миннеахметов Дамир,Наличные,Техника Горбушка,1,13 000,11 000,2 000,"15,4%","Наушники AirPods (4-го поколения, 2024) с шумоподавлением"
02.04.2026,17175,Миннеахметов Дамир,Наличные,Техника Горбушка,1,57 500,54 000,3 500,"6,1%",Смартфон Apple iPhone 16 128 ГБ Синий
02.04.2026,17176,Котеев Денис,Наличные,Техника Горбушка,1,24 000,20 600,3 400,"14,2%",Смартфон Samsung Galaxy A36 | 8/256 ГБ (Серый | Awesome Gray)
02.04.2026,17180,Миннеахметов Дамир,Наличные,Техника Горбушка,1,84 500,80 700,3 800,"4,5%","Ноутбук Apple MacBook Air 13"" M4 (2025) 10C CPU/8C GPU, 16 ГБ RAM, 256 ГБ SSD, (Midnight black | Тёмная ночь)"
02.04.2026,17185,Миннеахметов Дамир,Наличные,Техника Горбушка,1,88 500,85 600,2 900,"3,3%",Смартфон Samsung Galaxy S25 Ultra | 12/1 ТБ (Black Titanium | Черный титан)
02.04.2026,17192,Котеев Денис,Наличные,Техника Горбушка,1,21 600,19 700,1 900,"8,8%",Беспроводная акустика JBL Xtreme 4 Черный
03.04.2026,17206,Казаков Артём,Наличные,Техника Горбушка,1,32 500,29 500,3 000,"9,2%","Планшет Apple iPad (2025 A16) 11"" Wi-Fi | 128 ГБ (Silver | Серебристый)"
03.04.2026,17206,Казаков Артём,Наличные,Техника Горбушка,1,32 500,29 500,3 000,"9,2%","Планшет Apple iPad (2025 A16) 11"" Wi-Fi | 128 ГБ (Silver | Серебристый)"
03.04.2026,17208,Казаков Артём,Наличные,Техника Горбушка,1,12 400,8 700,3 700,"29,8%","Наушники AirPods (4-го поколения, 2024)"
03.04.2026,17213,Миннеахметов Дамир,Наличные,Техника Горбушка,1,25 000,22 700,2 300,"9,2%",Смартфон Samsung Galaxy A56 | 8-128 ГБ (Черный | Awesome Graphite)
03.04.2026,17210,Казаков Артём,Наличные,Техника Горбушка,1,27 500,24 700,2 800,"10,2%",Планшет Xiaomi Pad 7 | Wi-Fi | 8-256 ГБ (Серый | Gray)
03.04.2026,17196,Меньшов Денис,Наличные,Техника Горбушка,1,22 000,20 200,1 800,"8,2%","Смарт-часы Apple Watch SE3 (2025) - 40 mm ремешок Sport band | Starlight, S-M"
03.04.2026,17216,Миннеахметов Дамир,Наличные,Техника Горбушка,1,149 000,135 000,14 000,"9,4%","MacBook Air 13"" M5 (2026) 10C CPU/10C GPU, 24 ГБ RAM, 1 ТБ SSD, (Sky Blue | Голубое небо)"
03.04.2026,17216,Миннеахметов Дамир,Наличные,Техника Горбушка,1,20 000,16 900,3 100,"15,5%",Беспроводные наушники AirPods Pro 3 MagSafe (USB-C) (2025)
03.04.2026,17221,Миннеахметов Дамир,Наличные,Техника Горбушка,1,113 900,111 500,2 400,"2,1%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Deep Blue | Глубокий синий)
03.04.2026,17234,Котеев Денис,Наличные,Техника магазин,1,44 900,40 500,4 400,"9,8%",Наушники Apple AirPods Max USB-C Черный
03.04.2026,17202,Казаков Артём,Наличные,Техника Горбушка,1,32 400,31 000,1 400,"4,3%","Смартфон Nothing Phone 3A Pro, 12/256 ГБ (Серый | Grey)"
03.04.2026,17245,Миннеахметов Дамир,Наличные,Техника Горбушка,1,83 000,80 500,2 500,"3,0%","Ноутбук Apple MacBook Air 13"" M4 (2025) 10C CPU/8C GPU, 16 ГБ RAM, 256 ГБ SSD, (Sky Blue | Небесно-голубой)"
03.04.2026,17250,Котеев Денис,Наличные,Техника магазин,1,50 000,40 800,9 200,"18,4%",Игровая приставка Sony PlayStation 5 Slim 1 ТБ
03.04.2026,17253,Меньшов Денис,Наличные,Техника Горбушка,1,99 000,95 000,4 000,"4,0%",Смартфон Apple iPhone 17 Pro | e-Sim 256 ГБ (Cosmic Orange | Космический оранжевый)
03.04.2026,17232,Казаков Артём,Наличные,Техника Горбушка,1,64 500,62 700,1 800,"2,8%",Смартфон Xiaomi Poco F8 Ultra | 16-512 ГБ Черный
03.04.2026,17258,Котеев Денис,Наличные,Техника Горбушка,1,105 500,93 700,11 800,"11,2%","Ноутбук Apple MacBook Air 13"" M4 (2025) 10C CPU/8C GPU, 16 ГБ RAM, 512 ГБ SSD, (Silver | серебристый)"
03.04.2026,17258,Котеев Денис,Наличные,Техника Горбушка,1,32 500,28 700,3 800,"11,7%","Планшет Apple iPad (2025 A16) 11"" Wi-Fi | 128 ГБ (Silver | Серебристый)"
03.04.2026,17252,Котеев Денис,Наличные,Техника Горбушка,1,70 200,65 700,4 500,"6,4%","Смартфон Samsung Galaxy S25 | 12/512 ГБ, Мятный"
04.04.2026,17203,Казаков Артём,Наличные,Техника Горбушка,1,69 200,63 700,5 500,"7,9%",Смартфон Apple iPhone 17 | 256 ГБ (Белый | White)
04.04.2026,17115,Соловьёв Андрей,Наличные,Техника Горбушка,1,68 500,63 700,4 800,"7,0%",Смартфон Apple iPhone 17 | 256 ГБ (Черный | Black)
04.04.2026,17115,Соловьёв Андрей,Наличные,Техника Горбушка,1,126 000,122 500,3 500,"2,8%",Смартфон Apple iPhone 17 Pro | 512 ГБ (Silver | Серебристый)
04.04.2026,17268,Соловьёв Андрей,Наличные,Техника Горбушка,1,112 700,107 500,5 200,"4,6%","Смартфон Samsung Galaxy Z Fold7 | 12-256 ГБ, Синий"
04.04.2026,17197,Соловьёв Андрей,Наличные,Техника Горбушка,1,69 499,63 700,5 799,"8,3%",Смартфон Apple iPhone 17 | 256 ГБ (Черный | Black)
04.04.2026,17275,Казаков Артём,Наличные,Техника Горбушка,1,76 500,71 500,5 000,"6,5%",Смартфон Apple iPhone 17 Air | 256 ГБ (Black | Черный)
04.04.2026,17274,Котеев Денис,Наличные,Техника Горбушка,1,85 000,79 800,5 200,"6,1%",Смартфон Apple iPhone 17 | 512 ГБ (Зеленый | Sage)
04.04.2026,17198,Соловьёв Андрей,Наличные,Техника Горбушка,1,118 300,113 700,4 600,"3,9%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Silver | Серебристый)
04.04.2026,17281,Котеев Денис,Наличные,Техника Горбушка,1,30 000,27 400,2 600,"8,7%","Планшет Apple iPad (2025 A16) 11"" Wi-Fi | 128 ГБ (Yellow | Желтый)"
04.04.2026,17282,Миннеахметов Дамир,Наличные,Техника Горбушка,1,13 900,11 000,2 900,"20,9%","Наушники AirPods (4-го поколения, 2024) с шумоподавлением"
04.04.2026,17251,Меньшов Денис,Наличные,Техника Горбушка,1,26 400,25 500,900,"3,4%",Смарт-часы Apple Watch S10 - 46 mm Алюминиевый корпус черный | ремешок Sport Loop | Черный
04.04.2026,17162,Меньшов Денис,Наличные,Техника магазин,1,199 900,157 000,42 900,"21,5%",HUAWEI MateBook X Pro Ultra Премиальная версия (Черный | Black)
04.04.2026,17288,Миннеахметов Дамир,Наличные,Техника Горбушка,1,99 400,95 500,3 900,"3,9%",Смартфон Apple iPhone 17 Pro | e-Sim 256 ГБ (Deep Blue | Глубокий синий)
04.04.2026,17290,Миннеахметов Дамир,Наличные,Техника Горбушка,1,12 000,11 000,1 000,"8,3%","Наушники AirPods (4-го поколения, 2024) с шумоподавлением"
04.04.2026,17290,Миннеахметов Дамир,Наличные,Техника Горбушка,1,12 000,11 000,1 000,"8,3%","Наушники AirPods (4-го поколения, 2024) с шумоподавлением"
04.04.2026,17291,Котеев Денис,Наличные,Техника магазин,1,116 900,113 500,3 400,"2,9%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Cosmic Orange | Космический оранжевый)
04.04.2026,17298,Котеев Денис,Наличные,Техника магазин,1,116 900,113 500,3 400,"2,9%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Cosmic Orange | Космический оранжевый)
04.04.2026,17300,Котеев Денис,Наличные,Техника магазин,1,45 000,40 500,4 500,"10,0%",Наушники Apple AirPods Max USB-C Фиолетовый
04.04.2026,17293,Миннеахметов Дамир,Наличные,Техника Горбушка,1,125 000,121 500,3 500,"2,8%",Смартфон Apple iPhone 17 Pro | 512 ГБ (Silver | Серебристый)
04.04.2026,17293,Миннеахметов Дамир,Наличные,Техника Горбушка,1,19 000,16 800,2 200,"11,6%",Беспроводные наушники AirPods Pro 3 MagSafe (USB-C) (2025)
04.04.2026,17295,Миннеахметов Дамир,Наличные,Техника Горбушка,1,68 000,64 000,4 000,"5,9%",Смартфон Apple iPhone 17 | 256 ГБ (Лавандовый | Lavender)
04.04.2026,17299,Миннеахметов Дамир,Наличные,Техника Горбушка,1,135 400,129 000,6 400,"4,7%",Смартфон Apple iPhone 17 Pro Max | 512 ГБ (Silver | Серебристый)
04.04.2026,17301,Бобылев Антон,Наличные,Техника Горбушка,1,99 000,92 500,6 500,"6,6%","Ноутбук Apple MacBook Air 13"" M4 (2025) 10C CPU/10C GPU, 16 ГБ RAM, 512 ГБ SSD, (Silver | серебристый)"
04.04.2026,17244,Казаков Артём,Наличные,Техника Горбушка,1,25 900,21 400,4 500,"17,4%",Смартфон Xiaomi Poco F6 5G | 12/512 ГБ (Черный | Black)
04.04.2026,17302,Миннеахметов Дамир,Наличные,Техника Горбушка,1,149 000,136 000,13 000,"8,7%","Ноутбук Apple MacBook Pro 14"" M5 (2025) 10C CPU-10C GPU, 16 ГБ RAM, 1 ТБ SSD, (Midnight Black| Темная ночь)"
04.04.2026,17305,Казаков Артём,Наличные,Техника магазин,1,25 400,22 800,2 600,"10,2%",Смартфон Xiaomi Poco X7 Pro | 12/256 ГБ Желтый
04.04.2026,17306,Казаков Артём,Наличные,Техника Горбушка,1,67 500,61 300,6 200,"9,2%",Планшет Samsung Galaxy Tab S10+ | LTE | 12-256 ГБ Серебристый
04.04.2026,17304,Котеев Денис,Наличные,Техника Горбушка,1,54 000,46 900,7 100,"13,1%","Apple Mac Mini M4 (2024) 10C CPU/10C GPU, 16 ГБ RAM, 256 ГБ SSD (MU9D3)"
04.04.2026,17304,Котеев Денис,Наличные,Техника Горбушка,1,18 000,14 600,3 400,"18,9%",Смарт-часы Apple Watch SE2 (2023) - 44 mm | Midnight black | S/M
04.04.2026,17312,Бобылев Антон,Наличные,Техника Горбушка,1,152 000,145 800,6 200,"4,1%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 2 ТБ (Cosmic Orange | Космический оранжевый)"
04.04.2026,17313,Миннеахметов Дамир,Наличные,Техника Горбушка,1,107 000,103 700,3 300,"3,1%",Смартфон Apple iPhone 17 Pro | 256 ГБ (Silver | Серебристый)
05.04.2026,17285,Казаков Артём,Наличные,Техника магазин,1,49 000,40 800,8 200,"16,7%",Игровая приставка Sony PlayStation 5 Slim 1 ТБ
05.04.2026,17318,Смирнов Андрей,Наличные,Техника Горбушка,1,116 900,111 500,5 400,"4,6%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Deep Blue | Глубокий синий)
05.04.2026,17319,Смирнов Андрей,Наличные,Техника магазин,1,73 900,58 600,15 300,"20,7%","Робот-пылесос Dreame X40 Ultra Complete EU, Черный"
05.04.2026,17296,Соловьёв Андрей,Наличные,Техника магазин,1,85 500,73 100,12 400,"14,5%","Смартфон Honor Magic 8 Pro, 16/1 ТБ Золотой"
05.04.2026,17331,Котеев Денис,Наличные,Техника Горбушка,1,135 900,127 800,8 100,"6,0%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 1 ТБ (Cosmic Orange | Космический оранжевый)"
05.04.2026,17333,Котеев Денис,Наличные,Техника Горбушка,1,93 000,90 000,3 000,"3,2%",Смартфон Apple iPhone 16 Pro Max 256 ГБ Desert Titanium
05.04.2026,17341,Бобылев Антон,Наличные,Техника Горбушка,1,115 000,111 300,3 700,"3,2%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Deep Blue | Глубокий синий)
05.04.2026,17344,Котеев Денис,Наличные,Техника Горбушка,1,121 000,117 700,3 300,"2,7%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 512 ГБ (Deep Blue | Глубокий синий)"
05.04.2026,17351,Бобылев Антон,Наличные,Техника Горбушка,1,121 400,117 600,3 800,"3,1%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 512 ГБ (Deep Blue | Глубокий синий)"
05.04.2026,17348,Бобылев Антон,Наличные,Техника Горбушка,1,98 500,95 800,2 700,"2,7%","Планшет Apple iPad Pro (2025 M5) 11"" Wi-Fi | 512 ГБ Space Black"
05.04.2026,17347,Котеев Денис,Наличные,Техника Горбушка,1,159 600,146 700,12 900,"8,1%","Планшет Apple iPad Pro (2025 M5) 13"" Wi-Fi + Cellular | 1 ТБ Space Black"
05.04.2026,17349,Котеев Денис,Наличные,Техника Горбушка,1,45 000,40 700,4 300,"9,6%",Смартфон Apple iPhone 14 128 ГБ Black
05.04.2026,17352,Котеев Денис,Наличные,Техника Горбушка,1,37 200,33 800,3 400,"9,1%","Планшет Xiaomi Pad 8 | Wi-Fi | 8/256 ГБ, Серый"
05.04.2026,17346,Бобылев Антон,Наличные,Техника Горбушка,1,7 500,5 300,2 200,"29,3%",Беспроводные наушники Marshall Major V Черный
05.04.2026,17361,Котеев Денис,Наличные,Техника Горбушка,1,24 900,21 300,3 600,"14,5%",Смартфон Xiaomi Poco F6 5G | 12/512 ГБ (Титановый | Titanium)
05.04.2026,17355,Котеев Денис,Наличные,Техника Горбушка,1,228 900,215 000,13 900,"6,1%","Apple Mac Studio M4 Max (2025) 14C CPU/32C GPU, 36 ГБ RAM, 512 ГБ SSD, Silver (MU963)"
05.04.2026,17365,Бобылев Антон,Наличные,Техника Горбушка,1,72 000,68 800,3 200,"4,4%",Смартфон Apple iPhone 17 Air | 256 ГБ (Light Blue | Голубой)
05.04.2026,17362,Котеев Денис,Наличные,Техника Горбушка,1,68 500,62 800,5 700,"8,3%",Смартфон Apple iPhone 17 | 256 ГБ (Черный | Black)
05.04.2026,17362,Котеев Денис,Наличные,Техника Горбушка,1,15 400,13 900,1 500,"9,7%","Беспроводные наушники Apple AirPods Pro 2 (2023) MagSafe USB-C, белый"
05.04.2026,17364,Котеев Денис,Наличные,Техника Горбушка,1,131 000,127 500,3 500,"2,7%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 1 ТБ (Cosmic Orange | Космический оранжевый)"
05.04.2026,17364,Котеев Денис,Наличные,Техника Горбушка,1,120 000,114 700,5 300,"4,4%","Планшет Apple iPad Pro (2025 M5) 13"" Wi-Fi | 512 ГБ Space Black"
05.04.2026,17369,Бобылев Антон,Наличные,Техника Горбушка,1,115 000,111 000,4 000,"3,5%",Смартфон Apple iPhone 17 Pro | e-Sim 512 ГБ (Silver | Серебристый)
06.04.2026,17373,Смирнов Андрей,Наличные,Техника Горбушка,1,118 500,113 500,5 000,"4,2%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Silver | Серебристый)
06.04.2026,17360,Смирнов Андрей,Наличные,Техника магазин,1,52 400,41 400,11 000,"21,0%","Экшн-камера Insta360 X5 Essentials Bundle, 360° 8К, 72 МП"
06.04.2026,17374,Меньшов Денис,Наличные,Техника Горбушка,1,84 400,76 000,8 400,"10,0%","Смарт-часы Garmin Fenix 8 Amoled - 47 mm Sapphire, Титановый светло-серый, оранжевый силиконовый ремешок"
06.04.2026,17350,Смирнов Андрей,Наличные,Техника Горбушка,1,67 900,63 000,4 900,"7,2%","Робот-пылесос Roborock Qrevo Curv, Белый"
06.04.2026,17386,Бобылев Антон,Наличные,Техника Горбушка,1,87 500,78 500,9 000,"10,3%","iPad Air (2026 M4) 13"" Wi-Fi | 256 ГБ, Purple"
06.04.2026,17151,Смирнов Андрей,Наличные,Техника Горбушка,1,30 800,27 000,3 800,"12,3%","Планшет Apple iPad (2025 A16) 11"" Wi-Fi | 128 ГБ (Blue | Синий)"
06.04.2026,17388,Смирнов Андрей,Наличные,Техника магазин,1,42 900,39 100,3 800,"8,9%",Смартфон Xiaomi 14T Pro | 12-512 ГБ Черный
06.04.2026,17394,Смирнов Андрей,Наличные,Техника Горбушка,1,310 000,275 000,35 000,"11,3%","MacBook Pro 16"" M5 Pro (2026) 18C CPU-20C GPU, 48 ГБ RAM, 1 ТБ SSD, (Silver | Серебристый)"
06.04.2026,17396,Котеев Денис,Наличные,Техника Горбушка,1,45 000,35 000,10 000,"22,2%","Умные очки Ray-Ban Wayfarer Gen 2 RW4012 601-7153, Shiny Black"
06.04.2026,17399,Котеев Денис,Наличные,Техника Горбушка,1,49 400,45 400,4 000,"8,1%",Смартфон Apple iPhone 15 128 ГБ (Желтый | Yellow)
06.04.2026,17390,Бобылев Антон,Наличные,Техника Горбушка,1,116 500,112 700,3 800,"3,3%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 512 ГБ (Cosmic Orange | Космический оранжевый)"
06.04.2026,17405,Меньшов Денис,Наличные,Техника Горбушка,1,32 000,29 000,3 000,"9,4%","Шлем виртуальной реальности Oculus Quest 3S, 256 ГБ"
06.04.2026,17391,Меньшов Денис,Наличные,Техника Горбушка,1,27 900,25 500,2 400,"8,6%","Смарт-часы Apple Watch S11 - 42 mm Aluminum Rose Gold case | Light Blush Sport band, S/M"
06.04.2026,17410,Меньшов Денис,Наличные,Техника Горбушка,1,78 400,73 300,5 100,"6,5%","Смарт-часы Apple Watch Ultra 3 - 49 mm Black Titanium case | ремешок Milanese Loop | Black, L"
06.04.2026,17255,Меньшов Денис,Наличные,Техника магазин,1,24 900,22 800,2 100,"8,4%",Смартфон Xiaomi Poco X7 Pro | 12/256 ГБ Зеленый
07.04.2026,17414,Бобылев Антон,Наличные,Техника Горбушка,1,105 300,97 000,8 300,"7,9%",Смартфон Apple iPhone 16 Pro Max 256 ГБ Natural Titanium
07.04.2026,17417,Меньшов Денис,Наличные,Техника Горбушка,1,32 600,22 800,9 800,"30,1%","Выпрямитель Dyson Corrale HS07, цвет Copper/Nickel"
07.04.2026,17406,Меньшов Денис,Наличные,Техника Горбушка,1,86 000,80 800,5 200,"6,0%","Ноутбук Apple MacBook Air 13"" M4 (2025) 10C CPU/8C GPU, 16 ГБ RAM, 256 ГБ SSD, (Midnight black | Тёмная ночь)"
07.04.2026,17423,Меньшов Денис,Наличные,Техника Горбушка,1,67 000,64 400,2 600,"3,9%",Смартфон Apple iPhone 17 | 256 ГБ (Зеленый | Sage)
07.04.2026,17422,Казаков Артём,Наличные,Техника Горбушка,1,21 900,20 000,1 900,"8,7%","Смартфон CMF Phone 2 Pro, 8/128 ГБ (Чёрный | Black)"
07.04.2026,17426,Бобылев Антон,Наличные,Техника Горбушка,1,64 000,60 800,3 200,"5,0%",Смартфон Apple iPhone 17 | eSim 256 ГБ (Лавандовый | Lavender)
07.04.2026,17418,Меньшов Денис,Наличные,Техника магазин,1,27 900,23 700,4 200,"15,1%","Пылесос Dreame H12 PRO FlexReach RU, Black"
07.04.2026,17425,Бобылев Антон,Наличные,Техника магазин,1,44 500,44 500,0,"0,0%",Портативная игровая консоль Nintendo Switch 2+ Mario Kart World
07.04.2026,17398,Бобылев Антон,Наличные,Техника Горбушка,1,130 000,128 500,1 500,"1,2%",Смартфон Apple iPhone 17 Pro Max | 512 ГБ (Silver | Серебристый)
07.04.2026,17434,Меньшов Денис,Наличные,Техника Горбушка,1,100 000,96 000,4 000,"4,0%",Смартфон Google Pixel 10 Pro | 16/1 ТБ | Obsidian (Черный)
07.04.2026,17438,Бобылев Антон,Наличные,Техника магазин,1,26 900,26 200,700,"2,6%",Беспроводные наушники Sony WH-1000XM6 (Black | Черный)
07.04.2026,17439,Меньшов Денис,Наличные,Техника магазин,1,44 900,42 800,2 100,"4,7%",Смартфон Xiaomi 14T Pro | 12/1 ТБ Черный
07.04.2026,17437,Меньшов Денис,Наличные,Техника Горбушка,1,46 900,40 100,6 800,"14,5%",Шлем виртуальной реальности Oculus Quest 3 512 ГБ
07.04.2026,17440,Казаков Артём,Наличные,Техника магазин,1,"99 100,00",93 500,"5 600,00","5,7%","Смартфон Samsung Galaxy S26 Ultra | 12/512 ГБ, Голубой"
07.04.2026,17441,Миннеахметов Дамир,Наличные,Техника Горбушка,1,39 600,38 500,1 100,"2,8%","Смартфон HUAWEI Pura 80, 12-256 ГБ (Frosted Black | Черный)"
07.04.2026,17442,Миннеахметов Дамир,Наличные,Техника Горбушка,1,13 000,10 900,2 100,"16,2%","Наушники AirPods (4-го поколения, 2024) с шумоподавлением"
07.04.2026,17443,Миннеахметов Дамир,Наличные,Техника Горбушка,1,86 000,84 000,2 000,"2,3%","Ноутбук Apple MacBook Air 13"" M4 (2025) 10C CPU/8C GPU, 16 ГБ RAM, 256 ГБ SSD, (Silver | серебристый)"
07.04.2026,17443,Миннеахметов Дамир,Наличные,Техника Горбушка,1,53 000,52 000,1 000,"1,9%",Смартфон Apple iPhone 15 256 ГБ (Черный | Black)
07.04.2026,17449,Миннеахметов Дамир,Наличные,Техника Горбушка,1,21 900,19 300,2 600,"11,9%","Смарт-часы Apple Watch SE3 (2025) - 40 mm ремешок Sport band | Starlight, M/L"
07.04.2026,17448,Казаков Артём,Наличные,Техника Горбушка,1,125 700,120 800,4 900,"3,9%",Смартфон Apple iPhone 17 Pro | 512 ГБ (Deep Blue | Глубокий синий)
07.04.2026,17450,Миннеахметов Дамир,Наличные,Техника Горбушка,1,86 100,78 500,7 600,"8,8%",Смартфон Samsung Galaxy S25 Ultra | 12/512 ГБ (Black Titanium | Черный титан)
"""

print("Writing sales_margin_full.csv...")
# We will write the full text to sales_margin_full.csv using raw reading from sys
