import sys

part2 = """08.04.2026,17451,Казаков Артём,Наличные,Техника Горбушка,1,107 999,107 999,0,"0,0%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 256 ГБ (Silver | Серебристый)"
08.04.2026,17433,Казаков Артём,Наличные,Техника Горбушка,1,133 699,128 700,4 999,"3,7%",Смартфон Apple iPhone 17 Pro Max | 512 ГБ (Cosmic Orange | Космический оранжевый)
08.04.2026,17460,Казаков Артём,Наличные,Техника Горбушка,1,31 200,28 500,2 700,"8,7%","Смартфон HONOR 400, 12/256 ГБ Черный"
08.04.2026,17461,Соловьёв Андрей,Наличные,Техника Горбушка,1,135 000,131 000,4 000,"3,0%",Смартфон Apple iPhone 17 Pro Max | 512 ГБ (Deep Blue | Глубокий синий)
08.04.2026,17454,Котеев Денис,Наличные,Техника Горбушка,1,19 600,16 600,3 000,"15,3%",Беспроводные наушники AirPods Pro 3 MagSafe (USB-C) (2025)
08.04.2026,17462,Котеев Денис,Наличные,Техника магазин,1,48 300,43 300,5 000,"10,4%",Игровая приставка Sony PlayStation 5 Slim 1 ТБ
08.04.2026,17463,Миннеахметов Дамир,Наличные,Техника Горбушка,1,19 000,16 600,2 400,"12,6%",Беспроводные наушники AirPods Pro 3 MagSafe (USB-C) (2025)
08.04.2026,17468,Миннеахметов Дамир,Наличные,Техника магазин,1,54 900,54 900,0,"0,0%",Смартфон HUAWEI Pura 80 Pro 512 ГБ  Черный
08.04.2026,17471,Соловьёв Андрей,Наличные,Техника магазин,1,25 400,22 800,2 600,"10,2%",Смартфон Xiaomi Poco X7 Pro | 12/256 ГБ Черный
08.04.2026,17473,Котеев Денис,Наличные,Техника Горбушка,1,107 300,103 500,3 800,"3,5%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 256 ГБ (Deep Blue | Глубокий синий)"
08.04.2026,17475,Миннеахметов Дамир,Наличные,Техника Горбушка,1,45 000,43 700,1 300,"2,9%","Смартфон Samsung Galaxy S25 FE | 8/512 ГБ, Черный"
08.04.2026,17476,Казаков Артём,Наличные,Техника Горбушка,1,107 000,103 200,3 800,"3,6%",Смартфон Apple iPhone 17 Pro | 256 ГБ (Silver | Серебристый)
08.04.2026,17483,Соловьёв Андрей,Наличные,Техника Горбушка,1,67 000,63 800,3 200,"4,8%",Смартфон Apple iPhone 17 | 256 ГБ (Лавандовый | Lavender)
08.04.2026,17488,Соловьёв Андрей,Наличные,Техника Горбушка,1,60 900,54 500,6 400,"10,5%","Смартфон Samsung Galaxy S25 Plus | 12/256 ГБ, Синий"
08.04.2026,17486,Миннеахметов Дамир,Наличные,Техника Горбушка,1,65 000,63 800,1 200,"1,8%",Смартфон Apple iPhone 17 | 256 ГБ (Лавандовый | Lavender)
08.04.2026,17491,Казаков Артём,Наличные,Техника магазин,1,19 900,14 000,5 900,"29,6%",Наушники Nothing Headphone (1) Белый
08.04.2026,17489,Котеев Денис,Наличные,Техника магазин,1,47 900,42 800,5 100,"10,6%",Смартфон Xiaomi 14T Pro | 12/1 ТБ Синий
08.04.2026,17494,Соловьёв Андрей,Наличные,Техника Горбушка,1,20 400,16 600,3 800,"18,6%",Беспроводные наушники AirPods Pro 3 MagSafe (USB-C) (2025)
08.04.2026,17495,Котеев Денис,Наличные,Техника Горбушка,1,115 100,110 600,4 500,"3,9%",Смартфон Apple iPhone 17 Pro | e-Sim 512 ГБ (Silver | Серебристый)
08.04.2026,17497,Миннеахметов Дамир,Наличные,Техника магазин,1,71 900,62 400,9 500,"13,2%",Смартфон Xiaomi 17 | 12/256 ГБ (Зеленый | Venture Green)
08.04.2026,17501,Казаков Артём,Наличные,Техника Горбушка,1,30 800,27 000,3 800,"12,3%",Смартфон Xiaomi Poco X7 Pro | 12/512 ГБ Черный
08.04.2026,17504,Миннеахметов Дамир,Наличные,Техника Горбушка,1,30 500,28 500,2 000,"6,6%","Планшет Apple iPad (2025 A16) 11"" Wi-Fi | 128 ГБ (Silver | Серебристый)"
08.04.2026,17503,Миннеахметов Дамир,Наличные,Техника Горбушка,1,18 000,16 600,1 400,"7,8%",Беспроводные наушники AirPods Pro 3 MagSafe (USB-C) (2025)
08.04.2026,17503,Миннеахметов Дамир,Наличные,Техника Горбушка,1,84 500,78 000,6 500,"7,7%","Ноутбук Apple MacBook Air 13"" M4 (2025) 10C CPU/8C GPU, 16 ГБ RAM, 256 ГБ SSD, (Midnight black | Тёмная ночь)"
08.04.2026,17505,Миннеахметов Дамир,Наличные,Техника Горбушка,1,78 000,75 000,3 000,"3,8%","Планшет Apple iPad Pro (2025 M5) 11"" Wi-Fi | 256 ГБ Silver"
09.04.2026,17487,Казаков Артём,Наличные,Техника Горбушка,1,128 500,127 500,1 000,"0,8%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 512 ГБ (Silver | Серебристый)"
09.04.2026,17510,Смирнов Андрей,Наличные,Техника Горбушка,1,67 300,63 000,4 300,"6,4%",Смартфон Apple iPhone 17 | 256 ГБ (Голубой | Mist Blue)
09.04.2026,17511,Смирнов Андрей,Наличные,Техника магазин,1,75 900,68 400,7 500,"9,9%",Смартфон Xiaomi 17 | 12-512 ГБ (Зеленый | Venture Green)
09.04.2026,17514,Миннеахметов Дамир,Наличные,Техника Горбушка,1,116 000,113 500,2 500,"2,2%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 512 ГБ (Cosmic Orange | Космический оранжевый)"
09.04.2026,17515,Смирнов Андрей,Наличные,Техника магазин,1,116 800,113 500,3 300,"2,8%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Cosmic Orange | Космический оранжевый)
09.04.2026,17519,Соловьёв Андрей,Наличные,Техника Горбушка,1,39 000,36 000,3 000,"7,7%","Смартфон Xiaomi Poco X8 Pro Max | 12-256 ГБ, Черный"
09.04.2026,17520,Котеев Денис,Наличные,Техника Горбушка,1,108 000,105 000,3 000,"2,8%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 256 ГБ (Silver | Серебристый)"
09.04.2026,17525,Миннеахметов Дамир,Наличные,Техника Горбушка,1,127 800,124 000,3 800,"3,0%",Квадрокоптер DJI Mini 5 Pro Fly More Combo Plus (DJI RC 2)
09.04.2026,17526,Котеев Денис,Наличные,Техника Горбушка,1,64 500,60 500,4 000,"6,2%",Смартфон Apple iPhone 17 | eSim 256 ГБ (Зеленый | Sage)
09.04.2026,17533,Миннеахметов Дамир,Наличные,Техника Горбушка,1,124 000,122 300,1 700,"1,4%",Смартфон Apple iPhone 17 Pro | 512 ГБ (Deep Blue | Глубокий синий)
09.04.2026,17540,Смирнов Андрей,Наличные,Техника магазин,1,71 900,61 700,10 200,"14,2%","MacBook Neo 13"" A18 (2026) 6C CPU/5C GPU, 8 ГБ RAM, 512 ГБ SSD, (Indigo | Индиго)"
09.04.2026,17541,Котеев Денис,Наличные,Техника Горбушка,1,100 200,98 300,1 900,"1,9%",Смартфон Apple iPhone 17 Pro | e-Sim 256 ГБ (Silver | Серебристый)
09.04.2026,17544,Миннеахметов Дамир,Наличные,Техника Горбушка,1,42 900,39 400,3 500,"8,2%",Смартфон Apple iPhone 14 128 ГБ Blue
09.04.2026,17547,Смирнов Андрей,Наличные,Техника магазин,1,105 000,94 300,10 700,"10,2%",Смартфон Xiaomi 17 Ultra 16-512 ГБ Белый
09.04.2026,17548,Котеев Денис,Наличные,Техника Горбушка,1,93 400,89 000,4 400,"4,7%",Смартфон Apple iPhone 16 Pro Max 256 ГБ Desert Titanium
10.04.2026,17560,Миннеахметов Дамир,Наличные,Техника магазин,1,16 400,15 000,1 400,"8,5%","Беспроводные наушники Apple AirPods Pro 2 (2023) MagSafe USB-C, белый"
10.04.2026,17572,Смирнов Андрей,Наличные,Техника Горбушка,1,27 000,26 200,800,"3,0%","Смарт-часы Apple Watch S11 - 42 mm Aluminum Rose Gold case | Light Blush Sport band, S/M"
10.04.2026,17411,Меньшов Денис,Наличные,Техника Горбушка,1,139 700,136 700,3 000,"2,1%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 1 ТБ (Silver | Серебристый)"
10.04.2026,17566,Меньшов Денис,Наличные,Техника Горбушка,1,125 700,122 500,3 200,"2,5%",Смартфон Apple iPhone 17 Pro | 512 ГБ (Deep Blue | Глубокий синий)
10.04.2026,17527,Смирнов Андрей,Наличные,Техника Горбушка,1,6 900,5 400,1 500,"21,7%",Беспроводные наушники Marshall Major V Черный
10.04.2026,17559,Меньшов Денис,Наличные,Техника Горбушка,1,39 000,36 300,2 700,"6,9%",Наушники Apple AirPods Max Lightning (MGYJ3R) Silver
10.04.2026,17570,Миннеахметов Дамир,Наличные,Техника магазин,1,121 900,104 000,17 900,"14,7%",Смартфон Xiaomi 17 Ultra 16/1 ТБ Зеленый
10.04.2026,17579,Смирнов Андрей,Наличные,Техника Горбушка,1,26 500,25 000,1 500,"5,7%",Смарт-часы Apple Watch S10 - 46 mm Алюминиевый корпус черный | ремешок Sport Loop | Черный
10.04.2026,17581,Меньшов Денис,Наличные,Техника магазин,1,86 900,79 000,7 900,"9,1%",Смартфон Xiaomi 15 Ultra | 16/512 ГБ Серебристый
10.04.2026,17582,Бобылев Антон,Наличные,Техника Горбушка,1,19 400,16 500,2 900,"14,9%",Беспроводные наушники AirPods Pro 3 MagSafe (USB-C) (2025)
10.04.2026,17586,Смирнов Андрей,Наличные,Техника Горбушка,1,71 700,66 400,5 300,"7,4%",Ошибка заполнения
10.04.2026,17592,Бобылев Антон,Наличные,Техника Горбушка,1,82 000,78 400,3 600,"4,4%",Смартфон Apple iPhone 17 | 512 ГБ (Черный | Black)
10.04.2026,17597,Миннеахметов Дамир,Наличные,Техника Горбушка,1,24 900,21 200,3 700,"14,9%",Смартфон Xiaomi Poco F6 5G | 12/512 ГБ (Титановый | Titanium)
10.04.2026,17602,Миннеахметов Дамир,Наличные,Техника Горбушка,1,170 000,159 500,10 500,"6,2%","Ноутбук Apple MacBook Pro 14"" M5 (2025) 10C CPU-10C GPU, 24 ГБ RAM, 1 ТБ SSD, (Midnight Black| Темная ночь)"
10.04.2026,17604,Бобылев Антон,Наличные,Техника Горбушка,1,45 900,42 500,3 400,"7,4%","Смартфон OnePlus 13S, 12/256 ГБ Черный"
10.04.2026,17573,Меньшов Денис,Наличные,Техника Горбушка,1,70 700,66 900,3 800,"5,4%",Смартфон Apple iPhone 16 Plus 256 ГБ Черный
10.04.2026,17573,Меньшов Денис,Наличные,Техника Горбушка,1,56 500,53 800,2 700,"4,8%",Смартфон Apple iPhone 16 128 ГБ Черный
10.04.2026,17609,Бобылев Антон,Наличные,Техника магазин,1,48 000,40 400,7 600,"15,8%",Игровая приставка Sony PlayStation 5 Slim 1 ТБ
10.04.2026,17608,Миннеахметов Дамир,Наличные,Техника Горбушка,1,63 000,61 900,1 100,"1,7%",Смартфон Apple iPhone 17 | eSim 256 ГБ (Белый | White)
10.04.2026,17613,Бобылев Антон,Наличные,Техника Горбушка,1,62 000,59 500,2 500,"4,0%",Смартфон Apple iPhone 17 | eSim 256 ГБ (Черный | Black)
11.04.2026,17606,Смирнов Андрей,Наличные,Техника Горбушка,1,117 000,112 000,5 000,"4,3%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Silver | Серебристый)
11.04.2026,17620,Казаков Артём,Наличные,Техника Горбушка,1,31 000,28 500,2 500,"8,1%",Смарт-часы Apple Watch S11 - 46 mm Aluminium Silver case | Purple Fog Sport band M/L
11.04.2026,17614,Меньшов Денис,Наличные,Техника Горбушка,1,157 400,145 000,12 400,"7,9%","MacBook Air 15"" M5 (2026) 10C CPU-10C GPU, 24 ГБ RAM, 1 ТБ SSD, (Sky Blue | Голубое небо)"
11.04.2026,17626,Меньшов Денис,Наличные,Техника Горбушка,1,12 400,10 900,1 500,"12,1%","Наушники AirPods (4-го поколения, 2024) с шумоподавлением"
11.04.2026,17628,Казаков Артём,Наличные,Техника Горбушка,1,136 500,130 000,6 500,"4,8%",Смартфон Apple iPhone 17 Pro Max | 512 ГБ (Silver | Серебристый)
11.04.2026,17633,Миннеахметов Дамир,Наличные,Техника Горбушка,1,89 900,86 000,3 900,"4,3%",Смартфон Apple iPhone 17 | 512 ГБ (Белый | White)
11.04.2026,17636,Миннеахметов Дамир,Наличные,Техника Горбушка,1,30 000,27 700,2 300,"7,7%","Смарт-часы Apple Watch S11 - 46 mm Aluminum Jet Black case | Black Sport band, S/M"
11.04.2026,17639,Миннеахметов Дамир,Наличные,Техника Горбушка,1,104 200,100 900,3 300,"3,2%",Смартфон Apple iPhone 17 Pro | 256 ГБ (Silver | Серебристый)
11.04.2026,17638,Котеев Денис,Наличные,Техника Горбушка,1,32 500,28 500,4 000,"12,3%","Планшет Xiaomi Pad 7 (11"") | Wi-Fi | 12-256 ГБ, Голубой"
11.04.2026,17643,Меньшов Денис,Наличные,Техника Горбушка,1,109 500,103 000,6 500,"5,9%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 256 ГБ (Silver | Серебристый)"
11.04.2026,17642,Миннеахметов Дамир,Наличные,Техника Горбушка,1,65 000,62 000,3 000,"4,6%","Смартфон OnePlus 15, 12/256 ГБ (Infinite Black | Черный)"
11.04.2026,17641,Котеев Денис,Наличные,Техника Горбушка,1,67 000,62 500,4 500,"6,7%",Смартфон Apple iPhone 17 | 256 ГБ (Черный | Black)
11.04.2026,17645,Бобылев Антон,Наличные,Техника Горбушка,1,10 500,8 900,1 600,"15,2%",Смартфон Xiaomi Poco C85 | 8/256 ГБ Зеленый
11.04.2026,17644,Бобылев Антон,Наличные,Техника Горбушка,1,24 000,20 000,4 000,"16,7%",Беспроводные-проводные наушники Marshall Monitor III A.N.C. черный
11.04.2026,17646,Миннеахметов Дамир,Наличные,Техника Горбушка,1,99 700,90 500,9 200,"9,2%","Смартфон Samsung Galaxy S26 Ultra | 12/512 ГБ, Фиолетовый"
11.04.2026,17652,Котеев Денис,Наличные,Техника Горбушка,1,82 900,75 500,7 400,"8,9%","Смартфон Honor Magic 8 Pro, 12-512 ГБ Черный"
11.04.2026,17653,Котеев Денис,Наличные,Техника Горбушка,1,94 500,90 400,4 100,"4,3%","MacBook Air 13"" M5 (2026) 10C CPU/8C GPU, 16 ГБ RAM, 512 ГБ SSD, (Silver | Серебристый)"
11.04.2026,17655,Казаков Артём,Наличные,Техника Горбушка,1,32 500,29 400,3 100,"9,5%",Смартфон Samsung Galaxy A56 | 12/256 ГБ (Серый | Awesome Lightgray)
11.04.2026,17657,Меньшов Денис,Наличные,Техника Горбушка,1,54 900,53 000,1 900,"3,5%",Смартфон HUAWEI Pura 80 Pro 512 ГБ  Черный
11.04.2026,17659,Котеев Денис,Наличные,Техника Горбушка,1,3 500,2 500,1 000,"28,6%","Наушники Apple EarPods с разъёмом USB-C, белый (MTJY3)"
11.04.2026,17663,Бобылев Антон,Наличные,Техника Горбушка,1,67 000,62 900,4 100,"6,1%",Смартфон Apple iPhone 17 | 256 ГБ (Лавандовый | Lavender)
11.04.2026,17669,Казаков Артём,Наличные,Техника Горбушка,1,72 900,71 500,1 400,"1,9%",Смартфон Apple iPhone 17 Air | 256 ГБ (Black | Черный)
11.04.2026,17673,Котеев Денис,Наличные,Техника Горбушка,1,109 500,103 200,6 300,"5,8%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 256 ГБ (Silver | Серебристый)"
11.04.2026,17648,Казаков Артём,Наличные,Техника Горбушка,1,67 300,62 600,4 700,"7,0%",Смартфон Apple iPhone 17 | 256 ГБ (Белый | White)
11.04.2026,17678,Миннеахметов Дамир,Наличные,Техника Горбушка,1,94 000,92 500,1 500,"1,6%",Смартфон Apple iPhone 17 Air | 1 ТБ (Light Blue | Голубой)
11.04.2026,17678,Миннеахметов Дамир,Наличные,Техника Горбушка,1,94 000,90 000,4 000,"4,3%",Смартфон Apple iPhone 17 Air | 1 ТБ (Light Blue | Голубой)
11.04.2026,17672,Бобылев Антон,Наличные,Техника Горбушка,1,5 000,3 800,1 200,"24,0%",Беспроводные наушники CMF Buds Pro 2 by Nothing (TWS) White
11.04.2026,17656,Бобылев Антон,Наличные,Техника магазин,1,25 400,22 800,2 600,"10,2%",Смартфон Xiaomi Poco X7 Pro | 12-256 ГБ Черный
11.04.2026,17680,Бобылев Антон,Наличные,Техника Горбушка,1,19 400,16 500,2 900,"14,9%",Беспроводные наушники AirPods Pro 3 MagSafe (USB-C) (2025)
11.04.2026,17681,Миннеахметов Дамир,Наличные,Техника Горбушка,1,125 000,120 000,5 000,"4,0%","Планшет Apple iPad Pro (2025 M5) 13"" Wi-Fi + Cellular | 512 ГБ Space Black"
11.04.2026,17685,Миннеахметов Дамир,Наличные,Техника магазин,1,73 900,58 600,15 300,"20,7%","Робот-пылесос Dreame X40 Ultra Complete EU, Белый"
12.04.2026,17687,Казаков Артём,Наличные,Техника Горбушка,1,26 500,24 300,2 200,"8,3%",Ошибка заполнения
12.04.2026,17662,Казаков Артём,Наличные,Техника Горбушка,1,116 500,109 600,6 900,"5,9%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Deep Blue | Глубокий синий)
12.04.2026,17703,Котеев Денис,Наличные,Техника Горбушка,1,25 000,21 000,4 000,"16,0%","Смарт-часы Apple Watch SE3 (2025) - 44 mm ремешок Sport band | Starlight, S-M"
12.04.2026,17599,Меньшов Денис,Наличные,Техника Горбушка,1,46 900,44 000,2 900,"6,2%",Смартфон Apple iPhone 15 128 ГБ (Голубой | Blue)
12.04.2026,17699,Бобылев Антон,Наличные,Техника Горбушка,1,19 400,16 400,3 000,"15,5%",Беспроводные наушники AirPods Pro 3 MagSafe (USB-C) (2025)
12.04.2026,17702,Бобылев Антон,Наличные,Техника Горбушка,1,92 000,87 500,4 500,"4,9%",Смартфон Apple iPhone 16 Pro Max 256 ГБ Desert Titanium
12.04.2026,17702,Бобылев Антон,Наличные,Техника Горбушка,1,18 000,16 400,1 600,"8,9%",Беспроводные наушники AirPods Pro 3 MagSafe (USB-C) (2025)
12.04.2026,17704,Казаков Артём,Наличные,Техника Горбушка,1,20 900,16 800,4 100,"19,6%",Беспроводные/проводные наушники Beats Studio Pro коричневый
12.04.2026,17706,Котеев Денис,Наличные,Техника магазин,1,97 600,93 400,4 200,"4,3%","Смартфон Samsung Galaxy S26 Ultra | 12/512 ГБ, Черный"
12.04.2026,17708,Соловьёв Андрей,Наличные,Техника Горбушка,1,105 000,97 500,7 500,"7,1%","Планшет Apple iPad Pro (2025 M5) 13"" Wi-Fi + Cellular | 256 ГБ Space Black"
12.04.2026,17710,Котеев Денис,Наличные,Техника Горбушка,1,67 700,62 800,4 900,"7,2%",Смартфон Apple iPhone 17 | 256 ГБ (Зеленый | Sage)
12.04.2026,17707,Бобылев Антон,Наличные,Техника Горбушка,1,141 700,132 500,9 200,"6,5%",Смартфон Apple iPhone 17 Pro | 1 ТБ (Silver | Серебристый)
12.04.2026,17713,Бобылев Антон,Наличные,Техника магазин,1,115 000,113 500,1 500,"1,3%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Cosmic Orange | Космический оранжевый)
12.04.2026,17719,Котеев Денис,Наличные,Техника Горбушка,1,106 000,103 400,2 600,"2,5%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 256 ГБ (Silver | Серебристый)"
12.04.2026,17720,Котеев Денис,Наличные,Техника Горбушка,1,93 000,89 500,3 500,"3,8%","MacBook Air 13"" M5 (2026) 10C CPU/8C GPU, 16 ГБ RAM, 512 ГБ SSD, (Sky Blue | Голубое небо)"
12.04.2026,17723,Котеев Денис,Наличные,Техника Горбушка,1,46 700,42 700,4 000,"8,6%",Стайлер Dyson Airwrap HS09 Coanda2x Ceramic Pink-Rose Gold
12.04.2026,17728,Котеев Денис,Наличные,Техника Горбушка,1,106 000,103 700,2 300,"2,2%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 256 ГБ (Silver | Серебристый)"
12.04.2026,17670,Меньшов Денис,Наличные,Техника магазин,1,71 900,61 700,10 200,"14,2%","MacBook Neo 13"" A18 (2026) 6C CPU/5C GPU, 8 ГБ RAM, 512 ГБ SSD, (Citrus | Цитрус)"
12.04.2026,17731,Бобылев Антон,Наличные,Техника Горбушка,1,93 800,86 500,7 300,"7,8%",Смартфон Samsung Galaxy S25 Ultra | 12/1 ТБ (Silverblue Titanium | Синий титан)
12.04.2026,17733,Котеев Денис,Наличные,Техника Горбушка,1,69 900,61 900,8 000,"11,4%",Смартфон Xiaomi Poco F8 Ultra | 16-512 ГБ Черный
12.04.2026,17735,Бобылев Антон,Наличные,Техника Горбушка,1,66 000,63 200,2 800,"4,2%",Смартфон Apple iPhone 17 | 256 ГБ (Зеленый | Sage)
13.04.2026,17741,Соловьёв Андрей,Наличные,Техника магазин,1,12 400,10 900,1 500,"12,1%","Наушники AirPods (4-го поколения, 2024) с шумоподавлением"
13.04.2026,17740,Соловьёв Андрей,Наличные,Техника Горбушка,1,53 700,48 500,5 200,"9,7%",Смартфон Apple iPhone 17e | 256 ГБ White
13.04.2026,17736,Соловьёв Андрей,Наличные,Техника Горбушка,1,64 300,60 300,4 000,"6,2%",Смартфон Apple iPhone 16 256 ГБ Черный
13.04.2026,17714,Соловьёв Андрей,Наличные,Техника магазин,1,44 900,42 800,2 100,"4,7%",Смартфон Xiaomi 14T Pro | 12/1 ТБ Черный
13.04.2026,17753,Бобылев Антон,Наличные,Техника Горбушка,1,62 000,58 500,3 500,"5,6%","Смарт-часы Apple Watch Ultra 3 - 49 mm Black Titanium case | ремешок Trail Loop | Black/Charcoal, M/L"
13.04.2026,17690,Казаков Артём,Наличные,Техника Горбушка,1,98 700,93 000,5 700,"5,8%",Смартфон Apple iPhone 16 Pro 256 ГБ Black Titanium
13.04.2026,17634,Казаков Артём,Наличные,Техника Горбушка,1,72 000,66 200,5 800,"8,1%","Смартфон Samsung Galaxy S26 | 12/512 ГБ, Черный"
13.04.2026,17563,Смирнов Андрей,Наличные,Техника Горбушка,1,24 900,21 500,3 400,"13,7%","Робот-пылесос Dreame F21 Plus, белый"
13.04.2026,17769,Соловьёв Андрей,Наличные,Техника Горбушка,1,98 800,94 400,4 400,"4,5%",Смартфон Apple iPhone 17 Pro | e-Sim 256 ГБ (Silver | Серебристый)
13.04.2026,17627,Казаков Артём,Наличные,Техника Горбушка,1,66 500,62 500,4 000,"6,0%",Смартфон Apple iPhone 17 | 256 ГБ (Черный | Black)
13.04.2026,17776,Котеев Денис,Наличные,Техника Горбушка,1,106 200,101 000,5 200,"4,9%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 256 ГБ (Cosmic Orange | Космический оранжевый)"
13.04.2026,17781,Бобылев Антон,Наличные,Техника Горбушка,1,31 200,27 900,3 300,"10,6%","Планшет Apple iPad (2025 A16) 11"" Wi-Fi | 128 ГБ (Silver | Серебристый)"
13.04.2026,17784,Смирнов Андрей,Наличные,Техника Горбушка,1,41 000,36 700,4 300,"10,5%","Планшет Apple iPad (2025 A16) 11"" Wi-Fi | 256 ГБ (Silver | Серебристый)"
13.04.2026,17786,Бобылев Антон,Наличные,Техника Горбушка,1,42 000,36 000,6 000,"14,3%","Умные очки Ray-Ban Wayfarer Gen 2 RW4012 601-7153, Shiny Black"
13.04.2026,17787,Котеев Денис,Наличные,Техника Горбушка,1,25 200,22 500,2 700,"10,7%",Смартфон Samsung Galaxy A36 | 12/256 ГБ (Серый | Awesome Gray)
13.04.2026,17788,Котеев Денис,Наличные,Техника Горбушка,1,2 900,1 900,1 000,"34,5%","Наушники Apple EarPods с разъёмом Lightning, белый"
13.04.2026,17789,Котеев Денис,Наличные,Техника Горбушка,1,27 000,25 800,1 200,"4,4%","Смарт-часы Apple Watch S11 - 42 mm Aluminum Rose Gold case | Light Blush Sport band, S/M"
13.04.2026,17790,Смирнов Андрей,Наличные,Техника магазин,1,45 800,42 800,3 000,"6,6%",Смартфон Xiaomi 14T Pro | 12/1 ТБ Черный
13.04.2026,17793,Котеев Денис,Наличные,Техника Горбушка,1,32 000,29 300,2 700,"8,4%",Смартфон Samsung Galaxy A56 | 12-256 ГБ (Черный | Awesome Graphite)
13.04.2026,17793,Котеев Денис,Наличные,Техника магазин,1,4 000,2 500,1 500,"37,5%","Беспроводные наушники Nothing CMF Buds 2 B179, Оранжевый"
13.04.2026,17793,Котеев Денис,Наличные,Техника магазин,1,4 000,2 500,1 500,"37,5%","Беспроводные наушники Nothing CMF Buds 2 B179, Оранжевый"
13.04.2026,17794,Котеев Денис,Наличные,Техника Горбушка,1,41 000,36 000,5 000,"12,2%","Планшет Apple iPad (2025 A16) 11"" Wi-Fi | 256 ГБ (Silver | Серебристый)"
14.04.2026,17760,Смирнов Андрей,Наличные,Техника Горбушка,1,7 900,6 500,1 400,"17,7%",Беспроводные наушники Nothing Ear (a) B162 Белый
14.04.2026,17768,Соловьёв Андрей,Наличные,Техника Горбушка,1,56 000,52 000,4 000,"7,1%",Смартфон Xiaomi 15T Pro | 12/256 ГБ (Mocha Gold | Кофейное золото)
14.04.2026,17804,Миннеахметов Дамир,Наличные,Техника Горбушка,1,120 200,114 500,5 700,"4,7%",Смартфон Apple iPhone 17 Pro | 512 ГБ (Cosmic Orange | Космический оранжевый)
14.04.2026,17808,Миннеахметов Дамир,Наличные,Техника Горбушка,1,108 000,102 000,6 000,"5,6%",Смартфон Apple iPhone 16 Pro 256 ГБ White Titanium
14.04.2026,17810,Бобылев Антон,Наличные,Техника Горбушка,1,95 000,90 000,5 000,"5,3%",Смартфон Apple iPhone 17 Air | 512 ГБ (Black | Черный)
14.04.2026,17818,Смирнов Андрей,Наличные,Техника магазин,1,22 000,19 950,2 050,"9,3%",Смартфон Xiaomi Poco X7 | 12/512 ГБ Черный
14.04.2026,17826,Меньшов Денис,Наличные,Техника Горбушка,1,32 000,29 000,3 000,"9,4%",Экшн-камера DJI Osmo Action 4 Adventure Combo Black
14.04.2026,17828,Бобылев Антон,Наличные,Техника Горбушка,1,116 400,110 500,5 900,"5,1%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Silver | Серебристый)
14.04.2026,17830,Миннеахметов Дамир,Наличные,Техника Горбушка,1,67 000,62 700,4 300,"6,4%",Смартфон Apple iPhone 17 | 256 ГБ (Лавандовый | Lavender)
14.04.2026,17832,Меньшов Денис,Наличные,Техника Горбушка,1,132 000,127 000,5 000,"3,8%",Смартфон Apple iPhone 17 Pro Max | 512 ГБ (Deep Blue | Глубокий синий)
14.04.2026,17836,Меньшов Денис,Наличные,Техника Горбушка,1,126 500,121 000,5 500,"4,3%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 512 ГБ (Silver | Серебристый)"
14.04.2026,17834,Бобылев Антон,Наличные,Техника магазин,1,45 500,42 800,2 700,"5,9%",Смартфон Xiaomi 14T Pro | 12/1 ТБ Черный
14.04.2026,17835,Бобылев Антон,Наличные,Техника Горбушка,1,116 600,111 700,4 900,"4,2%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 512 ГБ (Cosmic Orange | Космический оранжевый)"
15.04.2026,17801,Смирнов Андрей,Наличные,Техника Горбушка,1,11 900,10 800,1 100,"9,2%","Наушники AirPods (4-го поколения, 2024) с шумоподавлением"
15.04.2026,17843,Казаков Артём,Наличные,Техника Горбушка,1,114 400,109 000,5 400,"4,7%",Смартфон Apple iPhone 17 Pro | e-Sim 512 ГБ (Silver | Серебристый)
15.04.2026,17845,Миннеахметов Дамир,Наличные,Техника Горбушка,1,138 600,129 000,9 600,"6,9%",Смартфон Apple iPhone 17 Pro | 1 ТБ (Silver | Серебристый)
15.04.2026,17596,Смирнов Андрей,Наличные,Техника Горбушка,1,56 200,52 300,3 900,"6,9%",Смартфон Apple iPhone 15 256 ГБ (Голубой | Blue)
15.04.2026,17849,Меньшов Денис,Наличные,Техника Горбушка,1,27 000,24 500,2 500,"9,3%",Смарт-часы Apple Watch S10 - 42 mm Алюминиевый корпус цвета розового золота | ремешок Sport Loop | Сливовый
15.04.2026,17841,Казаков Артём,Наличные,Техника магазин,1,47 900,42 800,5 100,"10,6%",Смартфон Xiaomi 14T Pro | 12/1 ТБ Синий
15.04.2026,17854,Казаков Артём,Наличные,Техника магазин,1,32 900,30 400,2 500,"7,6%","Смартфон Nothing Phone 3A Pro, 12-256 ГБ Черный"
15.04.2026,17854,Казаков Артём,Наличные,Техника Горбушка,1,14 900,12 000,2 900,"19,5%","Беспроводные наушники Nothing Ear (3) B173, Черный"
15.04.2026,17854,Казаков Артём,Наличные,Техника магазин,1,5 000,3 000,2 000,"40,0%","Смарт-часы CMF by Nothing Watch Pro 2 - пепельно-серый безель, пепельно-серый силиконовый ремешок"
15.04.2026,17855,Миннеахметов Дамир,Наличные,Техника Горбушка,1,108 200,103 000,5 200,"4,8%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 256 ГБ (Silver | Серебристый)"
15.04.2026,17857,Меньшов Денис,Наличные,Техника Горбушка,1,32 000,28 400,3 600,"11,3%","Смарт-часы Apple Watch S11 - 46 mm Aluminum Jet Black case | Black Sport band, S/M"
15.04.2026,17864,Казаков Артём,Наличные,Техника Горбушка,1,116 400,111 000,5 400,"4,6%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Silver | Серебристый)
15.04.2026,17865,Меньшов Денис,Наличные,Техника Горбушка,1,12 400,10 800,1 600,"12,9%","Наушники AirPods (4-го поколения, 2024) с шумоподавлением"
15.04.2026,17867,Бобылев Антон,Наличные,Техника Горбушка,1,104 000,99 600,4 400,"4,2%",Смартфон Apple iPhone 17 Pro | 256 ГБ (Deep Blue | Глубокий синий)
15.04.2026,17876,Казаков Артём,Наличные,Техника Горбушка,1,56 500,52 000,4 500,"8,0%","Смарт-часы Apple Watch S10 - 46 mm Титановый корпус | ремешок Milanese Loop | цвет Gold, S/M"
15.04.2026,17878,Бобылев Антон,Наличные,Техника Горбушка,1,104 000,101 000,3 000,"2,9%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 256 ГБ (Deep Blue | Глубокий синий)"
15.04.2026,17881,Бобылев Антон,Наличные,Техника магазин,1,20 000,18 800,1 200,"6,0%","Планшет Xiaomi Poco Pad M1 (12.1"") | Wi-Fi | 8/256 ГБ, Gray"
15.04.2026,17882,Бобылев Антон,Наличные,Техника Горбушка,1,111 000,106 500,4 500,"4,1%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Cosmic Orange | Космический оранжевый)
15.04.2026,17884,Миннеахметов Дамир,Наличные,Техника Горбушка,1,110 000,106 800,3 200,"2,9%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Cosmic Orange | Космический оранжевый)
15.04.2026,17886,Миннеахметов Дамир,Наличные,Техника Горбушка,1,66 500,63 600,2 900,"4,4%",Смартфон Apple iPhone 17 | 256 ГБ (Черный | Black)
15.04.2026,17890,Бобылев Антон,Наличные,Техника Горбушка,1,138 000,132 200,5 800,"4,2%",Смартфон Apple iPhone 17 Pro | 1 ТБ (Deep Blue | Глубокий синий)
16.04.2026,17899,Казаков Артём,Наличные,Техника Горбушка,1,111 700,108 000,3 700,"3,3%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Deep Blue | Глубокий синий)
16.04.2026,17903,Миннеахметов Дамир,Наличные,Техника Горбушка,1,130 000,127 000,3 000,"2,3%",Смартфон Apple iPhone 17 Pro Max | 512 ГБ (Deep Blue | Глубокий синий)
16.04.2026,17901,Котеев Денис,Наличные,Техника Горбушка,1,17 500,16 400,1 100,"6,3%",Беспроводные наушники AirPods Pro 3 MagSafe (USB-C) (2025)
16.04.2026,17917,Котеев Денис,Наличные,Техника Горбушка,1,132 000,129 000,3 000,"2,3%",Смартфон Apple iPhone 17 Pro Max | 512 ГБ (Silver | Серебристый)
16.04.2026,17913,Миннеахметов Дамир,Наличные,Техника Горбушка,1,17 300,16 500,800,"4,6%",Беспроводные наушники AirPods Pro 3 MagSafe (USB-C) (2025)
16.04.2026,17919,Миннеахметов Дамир,Наличные,Техника Горбушка,1,116 000,113 000,3 000,"2,6%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Silver | Серебристый)
16.04.2026,17924,Котеев Денис,Наличные,Техника Горбушка,1,65 500,63 500,2 000,"3,1%",Смартфон Apple iPhone 17 | 256 ГБ (Белый | White)
16.04.2026,17929,Казаков Артём,Наличные,Техника магазин,1,7 900,4 000,3 900,"49,4%",Беспроводные наушники Nothing Ear (a) B162 Желтый
16.04.2026,17938,Соловьёв Андрей,Наличные,Техника Горбушка,1,31 700,28 500,3 200,"10,1%","Планшет Apple iPad (2025 A16) 11"" Wi-Fi | 128 ГБ (Pink | Розовый)"
16.04.2026,17939,Соловьёв Андрей,Наличные,Техника Горбушка,1,138 200,126 000,12 200,"8,8%","MacBook Air 15"" M5 (2026) 10C CPU/10C GPU, 16 ГБ RAM, 1 ТБ SSD, (Silver | Серебристый)"
16.04.2026,17940,Миннеахметов Дамир,Наличные,Техника Горбушка,1,51 500,49 500,2 000,"3,9%",Смартфон Apple iPhone 17e | 256 ГБ Black
17.04.2026,17528,Смирнов Андрей,Наличные,Техника Горбушка,1,35 200,32 000,3 200,"9,1%","Экшн-камера Insta360 Ace Pro 2, Черный"
17.04.2026,17956,Соловьёв Андрей,Наличные,Техника Горбушка,1,12 400,11 000,1 400,"11,3%","Наушники AirPods (4-го поколения, 2024) с шумоподавлением"
17.04.2026,17959,Миннеахметов Дамир,Наличные,Техника Горбушка,1,9 400,7 600,1 800,"19,1%",Смартфон Xiaomi Redmi 15C | 4/128 ГБ (Черный | Midnight Black)
17.04.2026,17960,Миннеахметов Дамир,Наличные,Техника Горбушка,1,104 500,101 000,3 500,"3,3%",Смартфон Apple iPhone 17 Pro | 256 ГБ (Silver | Серебристый)
17.04.2026,17953,Смирнов Андрей,Наличные,Техника Горбушка,1,103 200,90 000,13 200,"12,8%",Смартфон Apple iPhone 15 Pro Max 512 ГБ (Black Titanium | Чёрный титан)
17.04.2026,17945,Соловьёв Андрей,Наличные,Техника Горбушка,1,139 800,132 800,7 000,"5,0%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 1 ТБ (Silver | Серебристый)"
17.04.2026,17945,Соловьёв Андрей,Наличные,Техника Горбушка,1,29 700,27 000,2 700,"9,1%",Смарт-часы Apple Watch S11 - 42 mm Aluminium Silver case | Purple Fog Sport band S/M
17.04.2026,17963,Котеев Денис,Наличные,Техника Горбушка,1,123 800,119 000,4 800,"3,9%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 512 ГБ (Deep Blue | Глубокий синий)"
17.04.2026,17962,Смирнов Андрей,Наличные,Техника магазин,1,148 500,149 000,-500,"-0,3%",Смартфон Apple iPhone 17 Pro Max | 1 ТБ (Deep Blue | Глубокий синий)
17.04.2026,17964,Миннеахметов Дамир,Наличные,Техника Горбушка,1,117 000,110 000,7 000,"6,0%","Смартфон Samsung Galaxy S26 Ultra | 16/1 ТБ, Голубой"
17.04.2026,17966,Соловьёв Андрей,Наличные,Техника Горбушка,1,58 900,51 500,7 400,"12,6%","Nothing Phone (3), 16-512 ГБ (Чёрный | Black)"
17.04.2026,17967,Миннеахметов Дамир,Наличные,Техника Горбушка,1,64 000,61 000,3 000,"4,7%",Смартфон Xiaomi Poco F8 Ultra | 16/512 ГБ Черный
17.04.2026,17969,Котеев Денис,Наличные,Техника Горбушка,1,96 500,94 000,2 500,"2,6%","MacBook Air 13"" M5 (2026) 10C CPU-8C GPU, 16 ГБ RAM, 512 ГБ SSD, (Silver | Серебристый)"
17.04.2026,17840,Меньшов Денис,Наличные,Техника Горбушка,1,116 600,116 000,600,"0,5%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 512 ГБ (Cosmic Orange | Космический оранжевый)"
17.04.2026,17978,Котеев Денис,Наличные,Техника Горбушка,1,86 000,82 800,3 200,"3,7%","Смартфон Samsung Galaxy S26 Ultra | 12/256 ГБ, Черный"
17.04.2026,17979,Смирнов Андрей,Наличные,Техника Горбушка,1,125 000,121 300,3 700,"3,0%",Смартфон Apple iPhone 17 Pro | 512 ГБ (Deep Blue | Глубокий синий)
17.04.2026,17975,Соловьёв Андрей,Наличные,Техника Горбушка,1,135 900,129 700,6 200,"4,6%","Ноутбук Apple MacBook Pro 14"" M5 (2025) 10C CPU-10C GPU, 16 ГБ RAM, 512 ГБ SSD, (Silver | Серебристый)"
17.04.2026,17981,Миннеахметов Дамир,Наличные,Техника Горбушка,1,51 700,49 200,2 500,"4,8%",Смартфон Apple iPhone 17e | 256 ГБ White
17.04.2026,17983,Котеев Денис,Наличные,Техника Горбушка,1,66 300,62 900,3 400,"5,1%",Смартфон Apple iPhone 17 | 256 ГБ (Голубой | Mist Blue)
17.04.2026,17821,Смирнов Андрей,Наличные,Техника магазин,1,45 000,39 100,5 900,"13,1%",Смартфон Xiaomi 14T Pro | 12/512 ГБ Черный
17.04.2026,17987,Миннеахметов Дамир,Наличные,Техника Горбушка,1,39 000,36 800,2 200,"5,6%",Смартфон Samsung Galaxy S24 | 8-256 ГБ (Onyx Black | Чёрный)
17.04.2026,17991,Миннеахметов Дамир,Наличные,Техника Горбушка,1,67 500,63 400,4 100,"6,1%",Смартфон Apple iPhone 17 | 256 ГБ (Черный | Black)
17.04.2026,17555,Смирнов Андрей,Наличные,Техника Горбушка,1,73 900,66 000,7 900,"10,7%","Робот-пылесос Dreame X40 Ultra Complete EU, Белый"
17.04.2026,18001,Котеев Денис,Наличные,Техника Горбушка,1,99 500,96 000,3 500,"3,5%",Смартфон Apple iPhone 17 Pro | e-Sim 256 ГБ (Silver | Серебристый)
17.04.2026,18013,Миннеахметов Дамир,Наличные,Техника Горбушка,1,26 300,24 500,1 800,"6,8%","Планшет Samsung Galaxy Tab S10 Lite (10.9"") | Wi-Fi | 6/128 ГБ Серебристый"
17.04.2026,18012,Соловьёв Андрей,Наличные,Техника Горбушка,1,106 498,103 100,3 398,"3,2%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 256 ГБ (Deep Blue | Глубокий синий)"
17.04.2026,18017,Котеев Денис,Наличные,Техника Горбушка,1,115 000,112 000,3 000,"2,6%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Deep Blue | Глубокий синий)
17.04.2026,18017,Котеев Денис,Наличные,Техника Горбушка,1,31 000,28 800,2 200,"7,1%","Смарт-часы Apple Watch S11 - 46 mm Aluminium Space Grey case | Black Sport band, M/L"
18.04.2026,18024,Меньшов Денис,Наличные,Техника Горбушка,1,31 900,28 500,3 400,"10,7%",Смартфон Samsung Galaxy A56 | 12/256 ГБ (Черный | Awesome Graphite)
18.04.2026,18025,Котеев Денис,Наличные,Техника Горбушка,1,62 000,59 400,2 600,"4,2%",Смартфон Apple iPhone 17 | eSim 256 ГБ (Лавандовый | Lavender)
18.04.2026,18002,Смирнов Андрей,Наличные,Техника Горбушка,1,62 700,59 800,2 900,"4,6%",Смартфон Apple iPhone 17 | eSim 256 ГБ (Лавандовый | Lavender)
18.04.2026,18020,Смирнов Андрей,Наличные,Техника Горбушка,1,68 000,65 200,2 800,"4,1%",Смартфон Apple iPhone 16 Plus 256 ГБ Белый
18.04.2026,18021,Смирнов Андрей,Наличные,Техника магазин,1,22 600,19 950,2 650,"11,7%",Смартфон Xiaomi Poco X7 | 12/512 ГБ Зеленый
18.04.2026,17944,Соловьёв Андрей,Наличные,Техника Горбушка,1,49 900,43 000,6 900,"13,8%",Стайлер Dyson Airwrap HS09 Coanda2x Ceramic Pink-Rose Gold
18.04.2026,17984,Соловьёв Андрей,Наличные,Техника магазин,1,374 000,311 000,63 000,"16,8%","Ноутбук-планшет Huawei MateBook Fold Ultimate Design (Kirin X90, 32 ГБ ОЗУ / 2 ТБ SSD) Black"
18.04.2026,18038,Котеев Денис,Наличные,Техника Горбушка,1,111 800,107 700,4 100,"3,7%",Смартфон Apple iPhone 16 Pro Max 512 ГБ Desert Titanium
18.04.2026,18023,Смирнов Андрей,Наличные,Техника Горбушка,1,85 200,80 700,4 500,"5,3%","Ноутбук Apple MacBook Air 13"" M4 (2025) 10C CPU-8C GPU, 16 ГБ RAM, 256 ГБ SSD, (Midnight black | Тёмная ночь)"
18.04.2026,18040,Меньшов Денис,Наличные,Техника Горбушка,1,133 000,130 000,3 000,"2,3%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 1 ТБ (Deep Blue | Глубокий синий)"
18.04.2026,18039,Бобылев Антон,Наличные,Техника Горбушка,1,104 000,101 000,3 000,"2,9%",Ошибка заполнения
18.04.2026,18045,Миннеахметов Дамир,Наличные,Техника Горбушка,1,31 700,28 400,3 300,"10,4%","Планшет Apple iPad (2025 A16) 11"" Wi-Fi | 128 ГБ (Pink | Розовый)"
18.04.2026,17954,Соловьёв Андрей,Наличные,Техника Горбушка,1,166 900,160 700,6 200,"3,7%","Смартфон Samsung Galaxy Z Fold7 | 16/1 ТБ, Синий"
18.04.2026,18051,Миннеахметов Дамир,Наличные,Техника Горбушка,1,114 500,113 000,1 500,"1,3%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Silver | Серебристый)
18.04.2026,18056,Бобылев Антон,Наличные,Техника Горбушка,1,125 000,120 000,5 000,"4,0%",Смартфон Apple iPhone 17 Pro | 512 ГБ (Deep Blue | Глубокий синий)
18.04.2026,18044,Меньшов Денис,Наличные,Техника Горбушка,1,85 700,85 000,700,"0,8%","Ноутбук Apple MacBook Air 13"" M4 (2025) 10C CPU/8C GPU, 16 ГБ RAM, 256 ГБ SSD, (Silver | серебристый)"
18.04.2026,18057,Миннеахметов Дамир,Наличные,Техника Горбушка,1,54 800,51 700,3 100,"5,7%",Смартфон Apple iPhone 16 128 ГБ Бирюзовый
18.04.2026,18062,Смирнов Андрей,Наличные,Техника Горбушка,1,98 800,94 200,4 600,"4,7%",Смартфон Apple iPhone 17 Pro | e-Sim 256 ГБ (Cosmic Orange | Космический оранжевый)
18.04.2026,18054,Котеев Денис,Наличные,Техника Горбушка,1,17 500,16 500,1 000,"5,7%",Беспроводные наушники AirPods Pro 3 MagSafe (USB-C) (2025)
18.04.2026,18054,Котеев Денис,Наличные,Техника Горбушка,1,12 500,11 000,1 500,"12,0%",Умная колонка Яндекс Станция Миди Зеленый
18.04.2026,18058,Котеев Денис,Наличные,Техника Горбушка,1,105 000,102 000,3 000,"2,9%",Смартфон Apple iPhone 17 Pro | 256 ГБ (Cosmic Orange | Космический оранжевый)
18.04.2026,18064,Миннеахметов Дамир,Наличные,Техника Горбушка,1,127 400,124 300,3 100,"2,4%",Смартфон Apple iPhone 17 Pro Max | 512 ГБ (Cosmic Orange | Космический оранжевый)
18.04.2026,18065,Меньшов Денис,Наличные,Техника Горбушка,1,28 900,27 300,1 600,"5,5%","Планшет Apple iPad (2025 A16) 11"" Wi-Fi | 128 ГБ (Blue | Синий)"
18.04.2026,18068,Смирнов Андрей,Наличные,Техника Горбушка,1,29 000,25 600,3 400,"11,7%","Смартфон Xiaomi Poco X8 Pro | 8/256 ГБ, Мятно-Голубой"
18.04.2026,18067,Бобылев Антон,Наличные,Техника Горбушка,1,92 000,85 000,7 000,"7,6%",Смартфон Apple iPhone 17 Air | 512 ГБ (Light Gold | Золотой)
18.04.2026,18070,Котеев Денис,Наличные,Техника Горбушка,1,18 500,16 500,2 000,"10,8%",Беспроводные наушники AirPods Pro 3 MagSafe (USB-C) (2025)
18.04.2026,17777,Котеев Денис,Наличные,Техника Горбушка,1,194 000,184 000,10 000,"5,2%","Ноутбук Apple MacBook Pro 14"" M4 Pro (2024) 14C CPU/20C GPU, 24 ГБ RAM, 1 ТБ SSD, Space Black"
18.04.2026,18072,Миннеахметов Дамир,Наличные,Техника Горбушка,1,7 000,5 400,1 600,"22,9%",Беспроводные наушники Marshall Major V Черный
18.04.2026,18079,Миннеахметов Дамир,Наличные,Техника Горбушка,1,118 000,111 000,7 000,"5,9%","Планшет Apple iPad Pro (2025 M5) 13"" Wi-Fi | 512 ГБ Space Black"
18.04.2026,18080,Миннеахметов Дамир,Наличные,Техника магазин,1,119 200,119 200,0,"0,0%","Смартфон Samsung Galaxy S26 Ultra | 16/1 ТБ, Черный"
18.04.2026,18080,Миннеахметов Дамир,Наличные,Техника Горбушка,1,17 900,14 300,3 600,"20,1%","Наушники Samsung Galaxy Buds 4 Pro, Черный"
18.04.2026,18080,Миннеахметов Дамир,Наличные,Техника Горбушка,1,26 000,23 500,2 500,"9,6%",Экшн-камера GoPro Hero 13 Black (CHDHX-131)
18.04.2026,18073,Бобылев Антон,Наличные,Техника магазин,1,46 800,42 800,4 000,"8,5%",Смартфон Xiaomi 14T Pro | 12/1 ТБ Черный
"""

with open("sales_margin_full.csv", "a", encoding="utf-8") as f:
    f.write(part2.strip() + "\n")
