import glob

part3 = """19.04.2026,18088,Казаков Артём,Наличные,Техника магазин,1,25 400,22 800,2 600,"10,2%",Смартфон Xiaomi Poco X7 Pro | 12-256 ГБ Черный
19.04.2026,18008,Соловьёв Андрей,Наличные,Техника Горбушка,1,125 800,121 100,4 700,"3,7%",Смартфон Apple iPhone 16 Pro Max 1 ТБ Desert Titanium
19.04.2026,18091,Котеев Денис,Наличные,Техника Горбушка,1,51 600,48 900,2 700,"5,2%",Смартфон Apple iPhone 17e | 256 ГБ Black
19.04.2026,18094,Казаков Артём,Наличные,Техника Горбушка,1,92 299,83 000,9 299,"10,1%",Смартфон Apple iPhone 17 Air | 512 ГБ (Black | Черный)
19.04.2026,18092,Бобылев Антон,Наличные,Техника Горбушка,1,127 000,123 800,3 200,"2,5%",Смартфон Apple iPhone 17 Pro Max | 512 ГБ (Cosmic Orange | Космический оранжевый)
19.04.2026,18092,Бобылев Антон,Наличные,Техника магазин,1,20 000,14 000,6 000,"30,0%",Наушники Nothing Headphone (1) Белый
19.04.2026,18097,Казаков Артём,Наличные,Техника магазин,1,116 000,104 000,12 000,"10,3%",Смартфон Xiaomi 17 Ultra 16/1 ТБ Белый
19.04.2026,18095,Котеев Денис,Наличные,Техника Горбушка,1,117 600,113 000,4 600,"3,9%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Silver | Серебристый)
19.04.2026,18095,Котеев Денис,Наличные,Техника Горбушка,1,44 000,37 700,6 300,"14,3%","Смартфон Xiaomi Poco X8 Pro Max | 12/512 ГБ, Черный"
19.04.2026,18095,Котеев Денис,Наличные,Техника Горбушка,1,44 000,37 700,6 300,"14,3%","Смартфон Xiaomi Poco X8 Pro Max | 12/512 ГБ, Черный"
19.04.2026,18093,Казаков Артём,Наличные,Техника Горбушка,1,61 300,59 900,1 400,"2,3%",Смартфон Apple iPhone 17 | eSim 256 ГБ (Черный | Black)
19.04.2026,18087,Меньшов Денис,Наличные,Техника Горбушка,1,128 500,122 700,5 800,"4,5%","Планшет Apple iPad Pro (2025 M5) 13"" Wi-Fi + Cellular | 512 ГБ Silver"
19.04.2026,18087,Меньшов Денис,Наличные,Техника Горбушка,1,11 000,8 300,2 700,"24,5%",Стилус Apple Pencil Pro (2024)
19.04.2026,18066,Меньшов Денис,Наличные,Техника Горбушка,1,62 900,61 700,1 200,"1,9%",Смартфон Samsung Galaxy S25 Edge | 12/512 ГБ (Черный | Titanium Jetblack)
19.04.2026,18099,Котеев Денис,Наличные,Техника Горбушка,1,27 500,25 000,2 500,"9,1%",Смарт-часы Apple Watch S10 - 46 mm Алюминиевый корпус черный | ремешок Sport Loop | Черный
19.04.2026,18100,Котеев Денис,Наличные,Техника Горбушка,1,75 900,72 500,3 400,"4,5%",Смартфон Apple iPhone 17 Air | 256 ГБ (Black | Черный)
19.04.2026,18105,Казаков Артём,Наличные,Техника Горбушка,1,69 000,66 000,3 000,"4,3%","Смартфон Samsung Galaxy Z Flip7 | 12/256 ГБ, Синий"
19.04.2026,18104,Бобылев Антон,Наличные,Техника Горбушка,1,114 000,111 000,3 000,"2,6%",Смартфон Apple iPhone 16 Pro Max 512 ГБ Black Titanium
19.04.2026,18106,Котеев Денис,Наличные,Техника Горбушка,1,66 000,62 300,3 700,"5,6%",Смартфон Apple iPhone 17 | 256 ГБ (Лавандовый | Lavender)
19.04.2026,18111,Котеев Денис,Наличные,Техника Горбушка,1,116 000,107 000,9 000,"7,8%","MacBook Air 15"" M5 (2026) 10C CPU/10C GPU, 16 ГБ RAM, 512 ГБ SSD, (Midnight | Тёмная ночь)"
19.04.2026,18109,Бобылев Антон,Наличные,Техника Горбушка,1,107 000,103 500,3 500,"3,3%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 256 ГБ (Deep Blue | Глубокий синий)"
19.04.2026,18110,Меньшов Денис,Наличные,Техника Горбушка,1,194 900,190 000,4 900,"2,5%","MacBook Pro 14"" M5 Pro (2026) 15C CPU/16C GPU, 24 ГБ RAM, 1 ТБ SSD, (Silver | Серебристый)"
19.04.2026,18114,Меньшов Денис,Наличные,Техника Горбушка,1,92 000,85 000,7 000,"7,6%",Смартфон Samsung Galaxy S25 Ultra | 12/1 ТБ (Pinkgold Titanium | Розовый титан)
19.04.2026,18115,Бобылев Антон,Наличные,Техника Горбушка,1,115 000,112 800,2 200,"1,9%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Silver | Серебристый)
19.04.2026,18081,Бобылев Антон,Наличные,Техника Горбушка,1,32 000,29 500,2 500,"7,8%",Смарт-часы Apple Watch S11 - 46 mm Aluminium Silver case | Purple Fog Sport band S/M
19.04.2026,18119,Бобылев Антон,Наличные,Техника магазин,1,104 900,92 100,12 800,"12,2%","Смартфон Honor Magic V5, Белый"
19.04.2026,17922,Казаков Артём,Наличные,Техника Горбушка,1,115 400,111 300,4 100,"3,6%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Deep Blue | Глубокий синий)
20.04.2026,18128,Казаков Артём,Наличные,Техника Горбушка,1,120 200,117 700,2 500,"2,1%",Смартфон Apple iPhone 17 Pro | 512 ГБ (Silver | Серебристый)
20.04.2026,18128,Казаков Артём,Наличные,Техника Горбушка,1,12 400,11 000,1 400,"11,3%","Наушники AirPods (4-го поколения, 2024) с шумоподавлением"
20.04.2026,18129,Котеев Денис,Наличные,Техника Горбушка,1,23 200,20 700,2 500,"10,8%",Смартфон Xiaomi Poco F6 5G | 12/512 ГБ (Черный | Black)
20.04.2026,18126,Казаков Артём,Наличные,Техника Горбушка,1,60 900,57 000,3 900,"6,4%","Очиститель воздуха Dreame PM20, Золотистый"
20.04.2026,18089,Казаков Артём,Наличные,Техника Горбушка,1,96 500,88 500,8 000,"8,3%","Смартфон Samsung Galaxy S26 Ultra | 12/512 ГБ, Фиолетовый"
20.04.2026,18131,Соловьёв Андрей,Наличные,Техника Горбушка,1,102 700,97 500,5 200,"5,1%",Смартфон Apple iPhone 17 Air | 1 ТБ (Light Gold | Золотой)
20.04.2026,18135,Казаков Артём,Наличные,Техника Горбушка,1,12 400,11 000,1 400,"11,3%","Наушники AirPods (4-го поколения, 2024) с шумоподавлением"
20.04.2026,18134,Котеев Денис,Наличные,Техника Горбушка,1,40 100,37 400,2 700,"6,7%",Смартфон Samsung Galaxy S24 | 8/256 ГБ (Onyx Black | Чёрный)
20.04.2026,18141,Бобылев Антон,Наличные,Техника магазин,1,27 000,25 700,1 300,"4,8%",Смартфон Xiaomi Poco M8 Pro | 12/512 ГБ (Green | Зеленый)
20.04.2026,18146,Соловьёв Андрей,Наличные,Техника Горбушка,1,66 700,63 000,3 700,"5,5%",Смартфон Apple iPhone 17 | 256 ГБ (Лавандовый | Lavender)
20.04.2026,18113,Меньшов Денис,Наличные,Техника Горбушка,1,39 000,35 000,4 000,"10,3%",Наушники Apple AirPods Max Lightning (MGYL3) Sky Blue
20.04.2026,18144,Казаков Артём,Наличные,Техника Горбушка,1,25 000,22 600,2 400,"9,6%",Nintendo Switch OLED Neon blue/red
20.04.2026,18154,Котеев Денис,Наличные,Техника магазин,1,41 400,34 668,6 732,"16,3%",Портативная игровая консоль Nintendo Switch 2 (Черный | Black)
20.04.2026,18153,Казаков Артём,Наличные,Техника Горбушка,1,106 000,103 000,3 000,"2,8%",Смартфон Apple iPhone 17 Pro | 256 ГБ (Deep Blue | Глубокий синий)
20.04.2026,18159,Казаков Артём,Наличные,Техника Горбушка,1,19 300,17 800,1 500,"7,8%",Смартфон Samsung Galaxy A26 | 8/256 ГБ (Белый | White)
20.04.2026,18164,Котеев Денис,Наличные,Техника Горбушка,1,148 000,141 400,6 600,"4,5%",Смартфон Apple iPhone 17 Pro Max | 1 ТБ (Deep Blue | Глубокий синий)
20.04.2026,18171,Котеев Денис,Наличные,Техника Горбушка,1,119 500,116 500,3 000,"2,5%",Смартфон Apple iPhone 17 Pro | 512 ГБ (Silver | Серебристый)
20.04.2026,18173,Котеев Денис,Наличные,Техника Горбушка,1,109 300,104 700,4 600,"4,2%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 256 ГБ (Silver | Серебристый)"
21.04.2026,18149,Казаков Артём,Наличные,Техника магазин,1,97 000,93 500,3 500,"3,6%","Смартфон Samsung Galaxy S26 Ultra | 12/512 ГБ, Черный"
21.04.2026,18009,Соловьёв Андрей,Наличные,Техника магазин,1,88 400,78 650,9 750,"11,0%","Смартфон Honor Magic 8 Pro, 16/1 ТБ Черный"
21.04.2026,18147,Соловьёв Андрей,Наличные,Техника магазин,1,86 900,79 000,7 900,"9,1%",Смартфон Xiaomi 15 Ultra | 16/512 ГБ Серебристый
21.04.2026,18176,Соловьёв Андрей,Наличные,Техника Горбушка,1,175 500,169 000,6 500,"3,7%",Смартфон Apple iPhone 17 Pro Max | 2 ТБ (Deep Blue | Глубокий синий)
21.04.2026,18181,Миннеахметов Дамир,Наличные,Техника Горбушка,1,65 000,63 000,2 000,"3,1%",Смартфон Apple iPhone 17 | 256 ГБ (Черный | Black)
21.04.2026,18181,Миннеахметов Дамир,Наличные,Техника магазин,1,5 000,3 000,2 000,"40,0%","Смарт-часы CMF by Nothing Watch Pro 2 - пепельно-серый безель, пепельно-серый силиконовый ремешок"
21.04.2026,18187,Миннеахметов Дамир,Наличные,Техника Горбушка,1,92 500,87 800,4 700,"5,1%",Смартфон Apple iPhone 16 Pro Max 256 ГБ Desert Titanium
21.04.2026,18190,Миннеахметов Дамир,Наличные,Техника Горбушка,1,45 000,41 800,3 200,"7,1%",Смартфон Apple iPhone 14 128 ГБ Starlight
21.04.2026,18184,Смирнов Андрей,Наличные,Техника Горбушка,1,50 900,46 500,4 400,"8,6%",Смартфон Apple iPhone 15 128 ГБ (Черный | Black)
21.04.2026,18182,Смирнов Андрей,Наличные,Техника магазин,1,75 900,68 400,7 500,"9,9%",Смартфон Xiaomi 17 | 12/512 ГБ (Розовый | Alpine Pink)
21.04.2026,18191,Миннеахметов Дамир,Наличные,Техника Горбушка,1,30 000,27 800,2 200,"7,3%","Планшет Apple iPad (2025 A16) 11"" Wi-Fi | 128 ГБ (Pink | Розовый)"
21.04.2026,18198,Смирнов Андрей,Наличные,Техника Горбушка,1,81 400,75 000,6 400,"7,9%",Смартфон Samsung Galaxy S25 Ultra | 12/512 ГБ (Silverblue Titanium | Синий титан)
21.04.2026,18202,Смирнов Андрей,Наличные,Техника Горбушка,1,149 300,139 000,10 300,"6,9%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 2 ТБ (Cosmic Orange | Космический оранжевый)"
21.04.2026,18203,Миннеахметов Дамир,Наличные,Техника Горбушка,1,46 000,44 000,2 000,"4,3%","Планшет Apple iPad Air (2025 M3) 11"" Wi-Fi | 128 ГБ (Space grey | Серый космос)"
21.04.2026,18207,Бобылев Антон,Наличные,Техника Горбушка,1,133 000,127 000,6 000,"4,5%",Смартфон Apple iPhone 17 Pro Max | 512 ГБ (Silver | Серебристый)
21.04.2026,18207,Бобылев Антон,Наличные,Техника Горбушка,1,91 000,84 000,7 000,"7,7%",Смартфон Apple iPhone 17 | 512 ГБ (Белый | White)
21.04.2026,18213,Бобылев Антон,Наличные,Техника Горбушка,1,28 400,21 500,6 900,"24,3%","Беспроводные наушники AirPods Pro 3 MagSafe (USB-C) (2025), Темно-синий"
21.04.2026,18213,Бобылев Антон,Наличные,Техника Горбушка,1,22 300,20 300,2 000,"9,0%","Смарт-часы Apple Watch SE3 (2025) - 44 mm ремешок Sport band | Midnight Black, M/L"
21.04.2026,18217,Миннеахметов Дамир,Наличные,Техника Горбушка,1,111 700,106 900,4 800,"4,3%",Смартфон Apple iPhone 17 Pro | e-Sim 512 ГБ (Deep Blue | Глубокий синий)
21.04.2026,18226,Бобылев Антон,Наличные,Техника Горбушка,1,7 500,7 500,0,"0,0%",Умная портативная колонка Яндекс Станция Стрит (Зеленый | Green)
21.04.2026,18229,Смирнов Андрей,Наличные,Техника магазин,1,204 900,177 800,27 100,"13,2%","Смартфон Huawei Mate XT Ultimate Design 16/1 ТБ, Красный"
21.04.2026,18227,Миннеахметов Дамир,Наличные,Техника Горбушка,1,90 000,87 800,2 200,"2,4%",Смартфон Apple iPhone 16 Pro Max 256 ГБ Desert Titanium
21.04.2026,18230,Миннеахметов Дамир,Наличные,Техника Горбушка,1,131 900,128 200,3 700,"2,8%",Смартфон Apple iPhone 17 Pro Max | 512 ГБ (Deep Blue | Глубокий синий)
21.04.2026,18231,Миннеахметов Дамир,Наличные,Техника Горбушка,1,43 900,38 700,5 200,"11,8%","Умные очки Ray-Ban Wayfarer Gen 2 RW4012 601-7153, Shiny Black"
21.04.2026,18232,Миннеахметов Дамир,Наличные,Техника Горбушка,1,88 500,86 000,2 500,"2,8%","MacBook Air 13"" M5 (2026) 10C CPU/8C GPU, 16 ГБ RAM, 512 ГБ SSD, (Sky Blue | Голубое небо)"
21.04.2026,18228,Бобылев Антон,Наличные,Техника Горбушка,1,12 400,11 400,1 000,"8,1%","Наушники AirPods (4-го поколения, 2024) с шумоподавлением"
21.04.2026,18233,Бобылев Антон,Наличные,Техника Горбушка,1,79 200,71 000,8 200,"10,4%","Смарт-часы Garmin Fenix 8 Solar Sapphire - 47 mm, Титановый, угольно-серый безель с DLC-покрытием, черный ремешок"
22.04.2026,18206,Смирнов Андрей,Наличные,Техника Горбушка,1,125 498,118 000,7 498,"6,0%",Смартфон Apple iPhone 17 Pro | 512 ГБ (Deep Blue | Глубокий синий)
22.04.2026,18243,Миннеахметов Дамир,Наличные,Техника Горбушка,1,43 900,43 000,900,"2,1%",Игровая приставка Sony PlayStation 5 Slim Digital Edition 1 ТБ
22.04.2026,18241,Смирнов Андрей,Наличные,Техника Горбушка,1,101 200,94 200,7 000,"6,9%","Планшет Apple iPad Pro (2025 M5) 13"" Wi-Fi + Cellular | 256 ГБ Space Black"
22.04.2026,18241,Смирнов Андрей,Наличные,Техника Горбушка,1,12 000,8 300,3 700,"30,8%",Стилус Apple Pencil Pro (2024)
22.04.2026,18189,Соловьёв Андрей,Наличные,Техника Горбушка,1,36 900,30 000,6 900,"18,7%",Стайлер Dyson Airwrap i.d. Long HS08 Straight+Wavy Pink-Rose Gold
22.04.2026,18186,Смирнов Андрей,Наличные,Техника Горбушка,1,30 700,27 700,3 000,"9,8%",Смартфон Xiaomi Poco X7 Pro | 12/512 ГБ Черный
22.04.2026,18205,Смирнов Андрей,Наличные,Техника Горбушка,1,30 100,27 600,2 500,"8,3%",Смартфон Xiaomi Poco X7 Pro | 12/512 ГБ Желтый
22.04.2026,18253,Бобылев Антон,Наличные,Техника Горбушка,1,29 500,26 500,3 000,"10,2%",Смарт-часы Apple Watch S11 - 42 mm Aluminium Silver case | Purple Fog Sport band S-M
22.04.2026,18254,Миннеахметов Дамир,Наличные,Техника Горбушка,1,74 900,69 000,5 900,"7,9%",Смартфон Apple iPhone 15 Pro 128 ГБ (White Titanium | Белый титан)
22.04.2026,18259,Миннеахметов Дамир,Наличные,Техника магазин,1,57 900,47 200,10 700,"18,5%","Смартфон HUAWEI Pura 70 Ultra, 16/512 ГБ (Green | Зеленый)"
22.04.2026,18257,Миннеахметов Дамир,Наличные,Техника Горбушка,1,17 900,16 500,1 400,"7,8%",Беспроводные наушники AirPods Pro 3 MagSafe (USB-C) (2025)
22.04.2026,18260,Меньшов Денис,Наличные,Техника магазин,1,47 900,43 300,4 600,"9,6%",Игровая приставка Sony PlayStation 5 Slim 1 ТБ
22.04.2026,18263,Бобылев Антон,Наличные,Техника Горбушка,1,63 000,59 000,4 000,"6,3%",Смарт-часы Apple Watch S11 - 42 mm Titanium Gold case | Gold Milanese Loop
22.04.2026,18251,Бобылев Антон,Наличные,Техника Горбушка,1,146 000,142 000,4 000,"2,7%",Смартфон Apple iPhone 17 Pro Max | 1 ТБ (Silver | Серебристый)
22.04.2026,18265,Миннеахметов Дамир,Наличные,Техника Горбушка,1,96 000,93 500,2 500,"2,6%",Смартфон Apple iPhone 17 Pro | e-Sim 256 ГБ (Silver | Серебристый)
22.04.2026,18249,Меньшов Денис,Наличные,Техника Горбушка,1,112 000,108 400,3 600,"3,2%",Смартфон Apple iPhone 17 Pro Max | 256 ГБ (Deep Blue | Глубокий синий)
22.04.2026,18260,Меньшов Денис,Наличные,Техника Горбушка,1,3 900,2 500,1 400,"35,9%",Игра для PS5 HotWheels Unleashed 2 Turbocharge
22.04.2026,18269,Смирнов Андрей,Наличные,Техника Горбушка,1,26 500,25 000,1 500,"5,7%",Смарт-часы Apple Watch S10 - 46 mm Алюминиевый корпус черный | ремешок Sport Loop | Черный
22.04.2026,18271,Бобылев Антон,Наличные,Техника Горбушка,1,13 500,11 400,2 100,"15,6%","Наушники Marshall Motif II ANC, цвет Черный"
22.04.2026,18271,Бобылев Антон,Наличные,Техника Горбушка,1,25 000,21 000,4 000,"16,0%","Смарт-часы Apple Watch S9 - 41 mm ремешок Sport band | Нежно-розовый, S/M"
22.04.2026,18278,Смирнов Андрей,Наличные,Техника Горбушка,1,105 500,99 100,6 400,"6,1%",Смартфон Apple iPhone 17 Pro | 256 ГБ (Silver | Серебристый)
22.04.2026,18280,Бобылев Антон,Наличные,Техника Горбушка,1,108 000,103 000,5 000,"4,6%","Смартфон Apple iPhone 17 Pro Max | e-Sim, 256 ГБ (Silver | Серебристый)"
"""

with open("sales_margin_full.csv", "a", encoding="utf-8") as f:
    f.write(part3.strip() + "\n")
